# Pentesting di Azure

<details>

<summary><strong>Impara l'hacking di AWS da zero a eroe con</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (Esperto Red Team di HackTricks AWS)</strong></a><strong>!</strong></summary>

Altri modi per supportare HackTricks:

* Se vuoi vedere la tua **azienda pubblicizzata in HackTricks** o **scaricare HackTricks in PDF** Controlla i [**PIANI DI ABBONAMENTO**](https://github.com/sponsors/carlospolop)!
* Ottieni il [**merchandising ufficiale di PEASS & HackTricks**](https://peass.creator-spring.com)
* Scopri [**La Famiglia PEASS**](https://opensea.io/collection/the-peass-family), la nostra collezione di [**NFT esclusivi**](https://opensea.io/collection/the-peass-family)
* **Unisciti al** 💬 [**gruppo Discord**](https://discord.gg/hRep4RUj7f) o al [**gruppo telegram**](https://t.me/peass) o **seguici** su **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Condividi i tuoi trucchi di hacking inviando PR a** [**HackTricks**](https://github.com/carlospolop/hacktricks) e [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>

## STO ANCORA SVILUPPANDO LA METODOLOGIA DI AZURE

## Informazioni di Base

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Metodologia del Pentester/Red Team di Azure

Per auditare un ambiente AZURE è molto importante sapere: quali **servizi vengono utilizzati**, cosa **viene esposto**, chi ha **accesso** a cosa, e come sono collegati i servizi interni di Azure e i **servizi esterni**.

Dal punto di vista del Red Team, il **primo passo per compromettere un ambiente Azure** è riuscire a ottenere delle **credenziali** per Azure AD. Ecco alcune idee su come fare:

* **Fughe** in github (o simili) - OSINT
* **Ingegneria** Sociale
* Riutilizzo delle **password** (fughe di password)
* Vulnerabilità nelle App ospitate su Azure
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) con accesso al punto di metadati
* **Lettura di File Locali**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Il file **`accessTokens.json`** in `az cli` prima della versione 2.30 - Jan2022 - memorizzava **token di accesso in chiaro**
* Il file **`azureProfile.json`** contiene **informazioni** sull'utente loggato.
* **`az logout`** rimuove il token.
* Le versioni precedenti di **`Az PowerShell`** memorizzavano **token di accesso** in **chiaro** in **`TokenCache.dat`**. Memorizzava anche **ServicePrincipalSecret** in **chiaro** in **`AzureRmContext.json`**. Il cmdlet **`Save-AzContext`** può essere utilizzato per **memorizzare** i **token**.\
Usa `Disconnect-AzAccount` per rimuoverli.
* Terze parti **violato**
* **Dipendente** Interno
* [**Phishing Comune**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credenziali o App Oauth)
* [Phishing di Autenticazione con Codice Dispositivo](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [**Password Spraying** di Azure](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Anche se non hai **compromesso alcun utente** all'interno del tenant Azure che stai attaccando, puoi **raccogliere alcune informazioni** da esso:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Dopo aver ottenuto le credenziali, devi sapere a **chi appartengono quelle credenziali**, e **a cosa hanno accesso**, quindi devi eseguire una semplice enumerazione:
{% endhint %}

## Enumerazione di Base

{% hint style="info" %}
Ricorda che la parte più **rumorosa** dell'enumerazione è il **login**, non l'enumerazione stessa.
{% endhint %}

### SSRF

Se hai trovato un SSRF in una macchina all'interno di Azure, controlla questa pagina per trucchi:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Bypass delle Condizioni di Login

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

Nei casi in cui hai delle credenziali valide ma non puoi effettuare il login, queste sono alcune protezioni comuni che potrebbero essere in atto:

* **Whitelisting degli IP** -- Devi compromettere un IP valido
* **Restrizioni Geografiche** -- Trova dove vive l'utente o dove si trovano gli uffici dell'azienda e ottieni un IP dalla stessa città (o almeno dallo stesso paese)
* **Browser** -- Forse è consentito solo un browser da determinati OS (Windows, Linux, Mac, Android, iOS). Scopri quale OS utilizza la vittima/l'azienda.
* Puoi anche provare a **compromettere le credenziali del Service Principal** poiché di solito sono meno limitate e il suo login è meno controllato

Dopo averlo bypassato, potresti essere in grado di tornare alla tua configurazione iniziale e avrai comunque accesso.

### Takeover del Sottodominio

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
Impara **come installare** az cli, AzureAD e Az PowerShell nella sezione [**Az - AzureAD**](az-azuread/).
{% endhint %}

Una delle prime cose che devi sapere è **chi sei** (in quale ambiente ti trovi):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %} 

## Scansione di Azure AD

Per condurre una scansione di Azure AD, è possibile utilizzare strumenti come **Azure AD Recon** o **Azure AD Connect** per raccogliere informazioni utili sull'organizzazione, come utenti, gruppi, ruoli e autorizzazioni. Queste informazioni possono essere utilizzate per identificare potenziali vulnerabilità e punti deboli nel sistema di gestione delle identità.

### Passaggi per la scansione di Azure AD:

1. **Raccolta di informazioni**: Utilizzare strumenti come Azure AD Recon per raccogliere informazioni sull'organizzazione, inclusi utenti, gruppi e ruoli.

2. **Analisi delle informazioni raccolte**: Esaminare attentamente le informazioni raccolte per identificare eventuali vulnerabilità o punti deboli nel sistema di gestione delle identità.

3. **Identificazione delle vulnerabilità**: Utilizzare le informazioni raccolte per identificare potenziali vulnerabilità come password deboli, autorizzazioni eccessive o configurazioni errate.

4. **Rapporto delle vulnerabilità**: Creare un rapporto dettagliato sulle vulnerabilità identificate e raccomandare azioni correttive per mitigare i rischi.

La scansione di Azure AD è un passo importante nel garantire la sicurezza dell'ambiente cloud e nel proteggere le risorse dell'organizzazione da potenziali minacce.

{% endtab %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %} 

## Az PowerShell

### Connect to Azure

To connect to Azure using Az PowerShell module, use the following command:

```bash
Connect-AzAccount
```

### List all Azure subscriptions

To list all Azure subscriptions associated with the account, use the following command:

```bash
Get-AzSubscription
```

### Select a specific Azure subscription

To select a specific Azure subscription, use the following command:

```bash
Select-AzSubscription -SubscriptionId <SubscriptionId>
```

Replace `<SubscriptionId>` with the ID of the subscription you want to select.

### List all resource groups

To list all resource groups within a subscription, use the following command:

```bash
Get-AzResourceGroup
```

### List all resources within a resource group

To list all resources within a specific resource group, use the following command:

```bash
Get-AzResource -ResourceGroupName <ResourceGroupName>
```

Replace `<ResourceGroupName>` with the name of the resource group.

### Get details of a specific resource

To get details of a specific resource, use the following command:

```bash
Get-AzResource -ResourceId <ResourceId>
```

Replace `<ResourceId>` with the ID of the resource.

{% endtab %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Uno dei comandi più importanti per enumerare Azure è **`Get-AzResource`** da Az PowerShell poiché ti permette di **conoscere le risorse su cui il tuo utente attuale ha visibilità**.

Puoi ottenere le stesse informazioni nella **console web** andando su [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) o cercando "Tutte le risorse"
{% endhint %}

### Enumerazione di AzureAD

Per impostazione predefinita, qualsiasi utente dovrebbe avere **abbastanza autorizzazioni per enumerare** cose come utenti, gruppi, ruoli, principali dei servizi... (controlla le [autorizzazioni predefinite di AzureAD](az-basic-information.md#default-user-permissions)).\
Puoi trovare qui una guida:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Ora che **hai alcune informazioni sulle tue credenziali** (e se sei un team red, sperabilmente **non sei stato rilevato**). È il momento di capire quali servizi vengono utilizzati nell'ambiente.\
Nella sezione seguente puoi controllare alcuni modi per **enumerare alcuni servizi comuni**.
{% endhint %}

## Principale del Servizio e Politica di Accesso

Un servizio Azure può avere un'Identità di Sistema (del servizio stesso) o utilizzare un'Identità Gestita Assegnata dall'Utente. Questa Identità può avere una Politica di Accesso per, ad esempio, un KeyVault per leggere segreti. Queste Politiche di Accesso dovrebbero essere limitate (principio del privilegio minimo), ma potrebbero avere più autorizzazioni del necessario. Tipicamente un Servizio App utilizzerebbe KeyVault per recuperare segreti e certificati.

Quindi è utile esplorare queste identità.

## Servizio App SCM

Console Kudu per accedere al 'container' del Servizio App.

## Webshell

Usa portal.azure.com e seleziona la shell, o usa shell.azure.com, per un bash o powershell. Il 'disco' di questa shell è memorizzato come un file immagine in un account di archiviazione.

## Azure DevOps

Azure DevOps è separato da Azure. Ha repository, pipeline (yaml o release), board, wiki e altro ancora. I Gruppi di Variabili vengono utilizzati per memorizzare valori di variabili e segreti.

## Strumenti di Ricognizione Automatica

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>Impara l'hacking AWS da zero a eroe con</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (Esperto Red Team AWS di HackTricks)</strong></a><strong>!</strong></summary>

Altri modi per supportare HackTricks:

* Se desideri vedere la tua **azienda pubblicizzata su HackTricks** o **scaricare HackTricks in PDF** Controlla i [**PIANI DI ABBONAMENTO**](https://github.com/sponsors/carlospolop)!
* Ottieni il [**merchandising ufficiale di PEASS & HackTricks**](https://peass.creator-spring.com)
* Scopri [**La Famiglia PEASS**](https://opensea.io/collection/the-peass-family), la nostra collezione esclusiva di [**NFT**](https://opensea.io/collection/the-peass-family)
* **Unisciti al** 💬 [**gruppo Discord**](https://discord.gg/hRep4RUj7f) o al [**gruppo telegram**](https://t.me/peass) o **seguici** su **Twitter** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Condividi i tuoi trucchi di hacking inviando PR a** [**HackTricks**](https://github.com/carlospolop/hacktricks) e [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) repos di github.

</details>
