# Azure Pentesting

<details>

<summary><strong>Naučite hakovanje AWS-a od nule do heroja sa</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Drugi načini podrške HackTricks-u:

* Ako želite da vidite **vašu kompaniju reklamiranu na HackTricks-u** ili **preuzmete HackTricks u PDF formatu** proverite [**SUBSCRIPTION PLANS**](https://github.com/sponsors/carlospolop)!
* Nabavite [**zvanični PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Otkrijte [**The PEASS Family**](https://opensea.io/collection/the-peass-family), našu kolekciju ekskluzivnih [**NFT-ova**](https://opensea.io/collection/the-peass-family)
* **Pridružite se** 💬 [**Discord grupi**](https://discord.gg/hRep4RUj7f) ili [**telegram grupi**](https://t.me/peass) ili nas **pratite** na **Twitter-u** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Podelite svoje hakovanje trikove slanjem PR-ova na** [**HackTricks**](https://github.com/carlospolop/hacktricks) i [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repozitorijume.

</details>

## JOŠ UVEK GRADIM AZURE METODOLOGIJU

## Osnovne informacije

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure Pentester/Red Team Metodologija

Da biste izvršili reviziju AZURE okruženja, veoma je važno znati: koje **usluge se koriste**, šta je **izloženo**, ko ima **pristup** čemu i kako su interni Azure servisi i **spoljni servisi** povezani.

Sa stanovišta Red Team-a, **prvi korak za kompromitovanje Azure okruženja** je uspeti da se dobiju neki **poverljivi podaci** za Azure AD. Evo nekih ideja kako to možete postići:

* **Curenje** na github-u (ili slično) - OSINT
* **Socijalno** inženjerstvo
* **Ponovna upotreba lozinke** (curenje lozinki)
* Ranjivosti u Azure-hostovanim aplikacijama
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) sa pristupom do metapodataka
* **Čitanje lokalnih fajlova**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Fajl **`accessTokens.json`** u `az cli` pre verzije 2.30 - Jan2022 - čuva **poverljive pristupne tokene u čistom tekstu**
* Fajl **`azureProfile.json`** sadrži **informacije** o prijavljenom korisniku.
* **`az logout`** uklanja token.
* Starije verzije **`Az PowerShell`** čuvaju **poverljive pristupne tokene** u **čistom** tekstu u **`TokenCache.dat`**. Takođe čuva **ServicePrincipalSecret** u **čistom** tekstu u **`AzureRmContext.json`**. Komanda **`Save-AzContext`** se može koristiti za **čuvanje** **tokena**.\
Koristite `Disconnect-AzAccount` da ih uklonite.
* 3. lica **hakovana**
* **Interni** zaposleni
* [**Uobičajeni Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (poverljivi podaci ili Oauth aplikacija)
* [Phishing autentifikacije putem Device koda](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Čak i ako **niste kompromitovali nijednog korisnika** unutar Azure zakupca kojeg napadate, možete **prikupiti neke informacije** o njemu:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Nakon što ste uspeli da dobijete poverljive podatke, morate znati **kome ti podaci pripadaju**, i **na šta imaju pristup**, pa morate izvršiti neko osnovno prebrojavanje:
{% endhint %}

## Osnovno prebrojavanje

{% hint style="info" %}
Zapamtite da je **najglasniji** deo prebrojavanja **prijava**, a ne samo prebrojavanje.
{% endhint %}

### SSRF

Ako ste pronašli SSRF na mašini unutar Azure, proverite ovu stranicu za trikove:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Zaobilaženje uslova prijave

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

U slučajevima kada imate validne poverljive podatke, ali ne možete se prijaviti, moguće su neke uobičajene zaštite:

* **IP bela lista** -- Morate kompromitovati validnu IP adresu
* **Geografska ograničenja** -- Pronađite gde korisnik živi ili gde su kancelarije kompanije i dobijte IP adresu iz istog grada (ili barem iste države)
* **Veb pregledač** -- Možda je dozvoljen samo pregledač određenog operativnog sistema (Windows, Linux, Mac, Android, iOS). Saznajte koji operativni sistem koristi žrtva/kompanija.
* Takođe možete pokušati da **kompromitujete poverljive podatke o servisnom principu** jer su obično manje ograničeni i njihova prijava se manje pregleda

Nakon zaobilaženja, možda ćete moći da se vratite na početno podešavanje i i dalje imate pristup.

### Preuzimanje poddomena

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Ko sam ja

{% hint style="danger" %}
Naučite **kako instalirati** az cli, AzureAD i Az PowerShell u odeljku [**Az - AzureAD**](az-azuread/).
{% endhint %}

Jedna od prvih stvari koje trebate znati je **ko ste** (u kojem okruženju se nalazite):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}AzureAD{% endtab %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Jedna od najvažnijih komandi za enumeraciju Azure-a je **`Get-AzResource`** iz Az PowerShell-a jer vam omogućava da **znate resurse koje vaš trenutni korisnik može videti**.

Istu informaciju možete dobiti i u **web konzoli** odlaskom na [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) ili pretraživanjem "All resources".
{% endhint %}

### AzureAD Enumeracija

Podrazumevano, svaki korisnik bi trebao imati **dovoljno dozvola za enumeraciju** stvari kao što su korisnici, grupe, uloge, servisni principali... (proverite [podrazumevane AzureAD dozvole](az-basic-information.md#default-user-permissions)).\
Ovde možete pronaći vodič:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Sada kada **imate neke informacije o svojim akreditivima** (i ako ste deo crvenog tima, nadamo se da **niste otkriveni**), vreme je da saznate koje usluge se koriste u okruženju.\
U sledećem odeljku možete proveriti neke načine za **enumeraciju nekih uobičajenih usluga**.
{% endhint %}

## Servisni principali i pristupna politika

Azure servis može imati sistemski identitet (samog servisa) ili koristiti dodeljeni upravljani identitet korisnika. Ovaj identitet može imati pristupnu politiku, na primer, KeyVault-u za čitanje tajni. Ove pristupne politike trebaju biti ograničene (princip najmanjih privilegija), ali mogu imati više dozvola nego što je potrebno. Tipično, App Service bi koristio KeyVault za dobijanje tajni i sertifikata.

Stoga je korisno istražiti ove identitete.

## App Service SCM

Kudu konzola za prijavu na App Service 'kontejner'.

## Webshell

Koristite portal.azure.com i izaberite shell, ili koristite shell.azure.com, za bash ili powershell. 'Disk' ovog šela se čuva kao slikovna datoteka u storage nalogu.

## Azure DevOps

Azure DevOps je odvojen od Azure-a. Ima repozitorije, pipeline-ove (yaml ili release), table, wiki i još mnogo toga. Grupama promenljivih se koriste za čuvanje vrednosti promenljivih i tajni.

## Automatizovani alati za istraživanje

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

AzureHound je alatka koja se koristi za prikupljanje informacija o Azure Active Directory (AAD) okruženjima. Ova alatka je zasnovana na BloodHound alatu i omogućava analizu i vizualizaciju veza između korisnika, grupa, računara i drugih entiteta u AAD okruženju. AzureHound može biti koristan za identifikaciju potencijalnih slabosti u AAD okruženju i pomaže u razumevanju strukture i odnosa unutar organizacije.
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar je alat koji je razvila NCC Group za testiranje bezbednosti Azure cloud okruženja. Ovaj alat pruža niz funkcionalnosti koje omogućavaju istraživanje i identifikaciju potencijalnih slabosti u Azure infrastrukturi. Azucar može da se koristi za pronalaženje osetljivih informacija, kao što su lozinke, ključevi i tokeni, kao i za otkrivanje ranjivosti u konfiguraciji i postavkama Azure resursa. Alat takođe pruža mogućnost izvršavanja napada na Azure okruženje kako bi se testirala njegova otpornost na napade. Azucar je koristan alat za pentestiranje Azure cloud okruženja i može pomoći u identifikaciji i rešavanju potencijalnih bezbednosnih problema.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

MicroBurst je alat koji se koristi za otkrivanje i iskorišćavanje slabosti u Azure okruženjima. Ovaj alat može da izvrši napade poput preuzimanja kontrolne tačke domena (Domain Controller) i izvršavanja proizvoljnog koda na Azure virtuelnim mašinama. MicroBurst koristi API-je Azure Management Service-a kako bi izvršio napade i omogućio hakeru da preuzme kontrolu nad Azure okruženjem.
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure je skup PowerShell skripti koje su dizajnirane za testiranje bezbednosti Azure okruženja. Ove skripte pružaju različite funkcionalnosti za identifikaciju slabosti i izvršavanje napada na Azure infrastrukturu. PowerZure je moćan alat koji omogućava pentesterima da testiraju sigurnost Azure platforme i identifikuju potencijalne ranjivosti.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>Naučite hakovanje AWS-a od nule do heroja sa</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Drugi načini podrške HackTricks-u:

* Ako želite da vidite **vašu kompaniju reklamiranu na HackTricks-u** ili **preuzmete HackTricks u PDF formatu** proverite [**SUBSCRIPTION PLANS**](https://github.com/sponsors/carlospolop)!
* Nabavite [**zvanični PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Otkrijte [**The PEASS Family**](https://opensea.io/collection/the-peass-family), našu kolekciju ekskluzivnih [**NFT-ova**](https://opensea.io/collection/the-peass-family)
* **Pridružite se** 💬 [**Discord grupi**](https://discord.gg/hRep4RUj7f) ili [**telegram grupi**](https://t.me/peass) ili nas **pratite** na **Twitter-u** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Podelite svoje hakovanje trikove slanjem PR-ova na** [**HackTricks**](https://github.com/carlospolop/hacktricks) i [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repozitorijume.

</details>
