# Pentesting Azure

<details>

<summary><strong>Apoie o HackTricks e obtenha benefícios!</strong></summary>

* Se você quiser ver sua **empresa anunciada no HackTricks** ou se quiser acessar a **última versão do PEASS ou baixar o HackTricks em PDF**, confira os [**PLANOS DE ASSINATURA**](https://github.com/sponsors/carlospolop)!
* Obtenha o [**oficial PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Descubra [**The PEASS Family**](https://opensea.io/collection/the-peass-family), nossa coleção exclusiva de [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Junte-se ao** 💬 [**grupo Discord**](https://discord.gg/hRep4RUj7f) ou ao [**grupo telegram**](https://t.me/peass) ou **siga-me** no **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm).
* **Compartilhe suas técnicas de hacking enviando PRs para os** [**HackTricks**](https://github.com/carlospolop/hacktricks) **e** [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) **repositórios do github.**

</details>

## AINDA ESTOU CONSTRUINDO A METODOLOGIA AZURE

## Informações básicas

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Metodologia de Pentester/Red Team do Azure

Para auditar um ambiente AZURE, é muito importante saber: quais **serviços estão sendo usados**, o que está **sendo exposto**, quem tem **acesso** a quê e como os serviços internos do Azure e **serviços externos** estão conectados.

Do ponto de vista do Red Team, o **primeiro passo para comprometer um ambiente Azure** é conseguir obter algumas **credenciais** para o Azure AD. Aqui estão algumas ideias sobre como fazer isso:

* **Vazamentos** no github (ou similar) - OSINT
* **Engenharia** social
* **Reutilização** de senhas (vazamentos de senhas)
* Vulnerabilidades em Aplicações Hospedadas no Azure
  * [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) com acesso ao endpoint de metadados
  * **Leitura de arquivo local**
    * `/home/USERNAME/.azure`
    * `C:\Users\USERNAME\.azure`
    * O arquivo **`accessTokens.json`** no `az cli` antes de 2.30 - Jan2022 - armazenava **tokens de acesso em texto claro**
    * O arquivo **`azureProfile.json`** contém **informações** sobre o usuário logado.
    * **`az logout`** remove o token.
    * Versões mais antigas do **`Az PowerShell`** armazenavam **tokens de acesso** em **texto claro** em **`TokenCache.dat`**. Ele também armazena **ServicePrincipalSecret** em texto claro em **`AzureRmContext.json`**. O cmdlet **`Save-AzContext`** pode ser usado para **armazenar** **tokens**.\
      Use `Disconnect-AzAccount` para removê-los.
* 3ª partes **invadidas**
* **Funcionário** interno
* [**Phishing** comum](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credenciais ou Oauth App)
  * [Phishing de Autenticação de Código de Dispositivo](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [**Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md) do Azure

Mesmo que você **não tenha comprometido nenhum usuário** dentro do tenant Azure que está atacando, você pode **coletar algumas informações** dele:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Depois de conseguir obter credenciais, você precisa saber **a quem essas credenciais pertencem** e **a que eles têm acesso**, então você precisa realizar alguma enumeração básica:
{% endhint %}

## Enumeração Básica

{% hint style="info" %}
Lembre-se de que a parte mais **barulhenta** da enumeração é o **login**, não a enumeração em si.
{% endhint %}

### SSRF

Se você encontrou um SSRF em uma máquina dentro do Azure, verifique esta página para truques:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Bypass Condições de Login

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

Nos casos em que você tem algumas credenciais válidas, mas não consegue fazer login, essas são algumas proteções comuns que podem estar em vigor:

* **Lista branca de IP** -- Você precisa comprometer um IP válido
* **Restrições geográficas** -- Encontre onde o usuário mora ou onde estão os escritórios da empresa e obtenha um IP da mesma cidade (ou pelo menos do mesmo país)
* **Navegador** -- Talvez apenas um navegador de determinado SO (Windows, Linux, Mac, Android, iOS) seja permitido. Descubra qual SO a vítima/empresa usa.
* Você também pode tentar **comprometer as credenciais do Service Principal** pois geralmente são menos limitadas e seu login é menos revisado

Depois de contorná-lo, você pode voltar à sua configuração inicial e ainda ter acesso.

### Whoami

{% hint style="danger" %}
Aprenda **como instalar** az cli, AzureAD e Az PowerShell na seção [**Az - AzureAD**](az-services/az-azuread.md).
{% endhint %}

Uma das primeiras coisas que você precisa saber é **quem você é** (em qual ambiente você está):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list 
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint
### [**Stormspotter**](https://github.com/Azure/Stormspotter)

```powershell
# Iniciar Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Iniciar Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Executar Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# Isso irá gerar um arquivo .zip para fazer upload no frontend (127.0.0.1:9091)
```

### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

```powershell
# Você precisa usar os módulos Az PowerShell e Azure AD:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Iniciar AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Consultas simples
## Todos os usuários do Azure
MATCH (n:AZUser) return n.name
## Todas as aplicações do Azure
MATCH (n:AZApp) return n.objectid
## Todos os dispositivos do Azure
MATCH (n:AZDevice) return n.name
## Todos os grupos do Azure
MATCH (n:AZGroup) return n.name
## Todos os cofres de chaves do Azure
MATCH (n:AZKeyVault) return n.name
## Todos os grupos de recursos do Azure
MATCH (n:AZResourceGroup) return n.name
## Todos os princípios de serviço do Azure
MATCH (n:AZServicePrincipal) return n.objectid
## Todas as máquinas virtuais do Azure
MATCH (n:AZVM) return n.name
## Todos os princípios com a função 'Contributor'
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Consultas avançadas
## Obter administradores globais
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Proprietários de grupos do Azure
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## Todos os usuários do Azure e seus grupos
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Princípios de serviço privilegiados
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Proprietários de aplicações do Azure
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Caminhos para VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Caminhos para KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Caminhos para grupo de recursos do Azure
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## Usuários locais com conexões no Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## Todos os grupos do Azure AD que estão sincronizados com o AD local
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```

### [Azucar](https://github.com/nccgroup/azucar)

```bash
# Você deve usar uma conta com permissão de leitura nos ativos que deseja acessar
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolver o TenantID para um nome de usuário específico
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```

### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```

### [**PowerZure**](https://github.com/hausec/PowerZure)

```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Leitor
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contribuinte
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Baixar o disco de uma máquina virtual

# Proprietário
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrador
$ Create-Backdoor, Execute-Backdoor
```

<details>

<summary><strong>Apoie o HackTricks e obtenha benefícios!</strong></summary>

* Se você quiser ver sua **empresa anunciada no HackTricks** ou se quiser acessar a **última versão do PEASS ou baixar o HackTricks em PDF**, confira os [**PLANOS DE ASSINATURA**](https://github.com/sponsors/carlospolop)!
* Adquira o [**swag oficial do PEASS & HackTricks**](https://peass.creator-spring.com)
* Descubra [**The PEASS Family**](https://opensea.io/collection/the-peass-family), nossa coleção exclusiva de [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Junte-se ao** 💬 [**grupo do Discord**](https://discord.gg/hRep4RUj7f) ou ao [**grupo do telegram**](https://t.me/peass) ou **siga-me** no **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm)**.**
* **Compartilhe seus truques de hacking enviando PRs para os repositórios do** [**HackTricks**](https://github.com/carlospolop/hacktricks) e [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud).

</details>