# рдПрдЬрд╝реНрдпреВрд░ рдкреЗрдВрдЯреЗрд╕реНрдЯрд┐рдВрдЧ

<details>

<summary><strong>рдЬрд╛рдиреЗрдВ AWS рд╣реИрдХрд┐рдВрдЧ рдХреЛ рд╢реВрдиреНрдп рд╕реЗ рд╣реАрд░реЛ рддрдХ</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong> рдХреЗ рд╕рд╛рде!</strong></summary>

HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рдиреЗ рдХреЗ рдЕрдиреНрдп рддрд░реАрдХреЗ:

* рдЕрдЧрд░ рдЖрдк рдЕрдкрдиреА **рдХрдВрдкрдиреА рдХрд╛ рд╡рд┐рдЬреНрдЮрд╛рдкрди HackTricks рдореЗрдВ рджреЗрдЦрдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рдпрд╛ **HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рддреЛ [**рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдкреНрд▓рд╛рдиреНрд╕ рджреЗрдЦреЗрдВ**](https://github.com/sponsors/carlospolop)!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS рдФрд░ HackTricks рд╕реНрд╡реИрдЧ**](https://peass.creator-spring.com) рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* рд╣рдорд╛рд░рд╛ рд╡рд┐рд╢реЗрд╖ [**NFTs**](https://opensea.io/collection/the-peass-family) рд╕рдВрдЧреНрд░рд╣, [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдЦреЛрдЬреЗрдВ
* **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** ЁЯТм [**рдбрд┐рд╕реНрдХреЙрд░реНрдб рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдпрд╛ рд╣рдореЗрдВ **рдЯреНрд╡рд┐рдЯрд░** ЁЯРж [**@hacktricks_live**](https://twitter.com/hacktricks_live)** рдкрд░ рдлреЙрд▓реЛ** рдХрд░реЗрдВред
* **рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** рджреНрд╡рд╛рд░рд╛ PRs рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗ [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВред

</details>

## рдореИрдВ рдЕрднреА рднреА рдПрдЬрд╝реНрдпреВрд░ рдореЗрдердбреЛрд▓реЙрдЬреА рдмрдирд╛ рд░рд╣рд╛ рд╣реВрдБ

## рдореВрд▓рднреВрдд рдЬрд╛рдирдХрд╛рд░реА

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## рдПрдЬрд╝реНрдпреВрд░ рдкреЗрдВрдЯреЗрд╕реНрдЯрд░/рд░реЗрдб рдЯреАрдо рдореЗрдердбреЛрд▓реЙрдЬреА

рдПрдХ AZURE рдкрд░рд┐рд╡реЗрд╢ рдХреА рдорд╛рдиреНрдпрддрд╛ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ рдХрд┐ рдкрддрд╛ рдЪрд▓реЗ: рдХреМрди рд╕реА **рд╕реЗрд╡рд╛рдПрдВ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВ**, рдХреНрдпрд╛ **рдЙрдЬрд╛рдЧрд░ рдХрд┐рдпрд╛ рдЬрд╛ рд░рд╣рд╛ рд╣реИ**, рдХрд┐рд╕рдХреЗ рдкрд╛рд╕ **рдкрд╣реБрдВрдЪ** рд╣реИ рдФрд░ рдЖрдВрддрд░рд┐рдХ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗрд╡рд╛рдПрдВ рдФрд░ **рдмрд╛рд╣реНрдп рд╕реЗрд╡рд╛рдПрдВ** рдХреИрд╕реЗ рдЬреБрдбрд╝реА рд╣реИрдВред

рд░реЗрдб рдЯреАрдо рдХреЗ рджреГрд╖реНрдЯрд┐рдХреЛрдг рд╕реЗ, **рдПрдХ рдПрдЬрд╝реНрдпреВрд░ рдкрд░рд┐рд╡реЗрд╢ рдХреЛ рдХрдВрдкреНрд░рдорд╛рдЗрдЬ** рдХрд░рдиреЗ рдХрд╛ **рдкрд╣рд▓рд╛ рдХрджрдо** рдХреБрдЫ **рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕** рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ рд╣реИред рдпрд╣рд╛рдБ рдЖрдкрдХреЛ рдЗрд╕реЗ рдХреИрд╕реЗ рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рд╡рд┐рдЪрд╛рд░ рдорд┐рд▓реЗрдВрдЧреЗ:

* github рдореЗрдВ **рд▓реАрдХ** - OSINT
* **рд╕реЛрд╢рд▓** рдЗрдВрдЬреАрдирд┐рдпрд░рд┐рдВрдЧ
* **рдкрд╛рд╕рд╡рд░реНрдб** рдкреБрди: рдЙрдкрдпреЛрдЧ (рдкрд╛рд╕рд╡рд░реНрдб рд▓реАрдХ)
* рдПрдЬрд╝реНрдпреВрд░-рд╣реЛрд╕реНрдЯреЗрдб рдПрдкреНрд▓рд┐рдХреЗрд╢рди рдореЗрдВ рд╡рдВрд╢рд╛рдиреБрдХреНрд░рдорд┐рдХрддрд╛
* [**рд╕рд░реНрд╡рд░ рд╕рд╛рдЗрдб рд░рд┐рдХреНрд╡реЗрд╕реНрдЯ рдлреЙрд░реНрдЬрд░реА**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) рдореЗрдЯрд╛рдбреЗрдЯрд╛ рдПрдВрдбрдкреЙрдЗрдВрдЯ рддрдХ рдкрд╣реБрдВрдЪ рдХреЗ рд╕рд╛рде
* **рд╕реНрдерд╛рдиреАрдп рдлрд╝рд╛рдЗрд▓ рдкрдврд╝реЗрдВ**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* **`accessTokens.json`** рдлрд╝рд╛рдЗрд▓ `az cli` 2.30 рд╕реЗ рдкрд╣рд▓реЗ - рдЬрдирд╡рд░реА 2022 - рдореЗрдВ **рд╕реНрдкрд╖реНрдЯ рдкрд╛рда рдореЗрдВ** **рдПрдХреНрд╕реЗрд╕ рдЯреЛрдХрдиреНрд╕** рд╕реНрдЯреЛрд░ рдХрд░рддреА рдереА
* **`azureProfile.json`** рдлрд╝рд╛рдЗрд▓ рдореЗрдВ рд▓реЙрдЧ рдЗрди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдЬрд╛рдирдХрд╛рд░реА** рд╣реЛрддреА рд╣реИред
* **`az logout`** рдЯреЛрдХрди рдХреЛ рд╣рдЯрд╛ рджреЗрддрд╛ рд╣реИред
* рдкреБрд░рд╛рдиреЗ рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдореЗрдВ **`Az PowerShell`** **рдЯреЛрдХрди** рдХреЛ **рд╕реНрдкрд╖реНрдЯ** рдкрд╛рда рдореЗрдВ **`TokenCache.dat`** рдореЗрдВ рд╕реНрдЯреЛрд░ рдХрд░рддрд╛ рдерд╛ред рдпрд╣ рднреА **`AzureRmContext.json`** рдореЗрдВ **рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓ рд╕реАрдХреНрд░реЗрдЯ** рдХреЛ **рд╕реНрдкрд╖реНрдЯ рдкрд╛рда рдореЗрдВ** рд╕реНрдЯреЛрд░ рдХрд░рддрд╛ рд╣реИред рдХрдорд╛рдВрдбрд▓реЗрдЯ **`Save-AzContext`** рдХрд╛ рдЙрдкрдпреЛрдЧ **рдЯреЛрдХрди** рд╕реНрдЯреЛрд░ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред\
рдЙрдиреНрд╣реЗрдВ рд╣рдЯрд╛рдиреЗ рдХреЗ рд▓рд┐рдП `Disconnect-AzAccount` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред
* 3rd рдкрд╛рд░реНрдЯреА **рднреЗрдЯ рдЧрдИ**
* **рдЖрдВрддрд░рд┐рдХ** рдХрд░реНрдордЪрд╛рд░реА
* [**рд╕рд╛рдорд╛рдиреНрдп рдлрд┐рд╢рд┐рдВрдЧ**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓ рдпрд╛ рдУрдЖрде рдРрдк)
* [рдбрд┐рд╡рд╛рдЗрд╕ рдХреЛрдб рдкреНрд░рдорд╛рдгреАрдХрд░рдг рдлрд┐рд╢рд┐рдВрдЧ](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [рдПрдЬрд╝реНрдпреВрд░ **рдкрд╛рд╕рд╡рд░реНрдб рд╕реНрдкреНрд░реЗрдЗрдВрдЧ**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

рдпрджрд┐ рдЖрдкрдиреЗ рдПрдЬрд╝реНрдпреВрд░ рдЯреЗрдиреЗрдВрдЯ рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ **рдХрдВрдкреНрд░рдорд╛рдЗрдЬрд╝ рдирд╣реАрдВ рдХрд┐рдпрд╛** рд╣реИ, рддреЛ рдЖрдк рдЗрд╕рд╕реЗ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА **рдЗрдХрдЯреНрдард╛** рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
рдЬрдм рдЖрдкрдиреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдкреНрд░рд╛рдкреНрдд рдХрд░ рд▓рд┐рдП рд╣реИрдВ, рддреЛ рдЖрдкрдХреЛ рдЬрд╛рдирдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реИ рдХрд┐ рд╡реЗ **рдХрд┐рд╕рдХреЗ рд╣реИрдВ**, рдФрд░ рдЙрдирдХреЗ рдкрд╛рд╕ рдХреНрдпрд╛ рд╣реИ рдкрд╣реБрдВрдЪ, рдЗрд╕рд▓рд┐рдП рдЖрдкрдХреЛ рдХреБрдЫ рдореВрд▓рднреВрдд рдЧрдгрдирд╛ рдХрд░рдиреА рд╣реЛрдЧреА:
{% endhint %}

## рдореВрд▓рднреВрдд рдЧрдгрдирд╛

{% hint style="info" %}
рдзреНрдпрд╛рди рд░рдЦреЗрдВ рдХрд┐ рдЧрдгрдирд╛ рдХрд╛ **рд╢реЛрд░** рд▓реЙрдЧрд┐рди рд╣реИ, рдЧрдгрдирд╛ рдирд╣реАрдВред
{% endhint %}

### SSRF

рдЕрдЧрд░ рдЖрдкрдиреЗ рдПрдЬрд╝реНрдпреВрд░ рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рдорд╢реАрди рдореЗрдВ SSRF рдкрд╛рдпрд╛ рд╣реИ, рддреЛ рдпреЗ рдЯреНрд░рд┐рдХреНрд╕ рдХреЗ рд▓рд┐рдП рдЗрд╕ рдкреЗрдЬ рдХреА рдЬрд╛рдБрдЪ рдХрд░реЗрдВ:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### рд▓реЙрдЧрд┐рди рд╢рд░реНрддреЛрдВ рдХреЛ рдЙрд▓реНрд▓рдВрдШрди рдХрд░реЗрдВ

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ рдХреБрдЫ рдорд╛рдиреНрдп рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рд╣реЛрддреЗ рд╣реИрдВ рд▓реЗрдХрд┐рди рдЖрдк рд▓реЙрдЧрд┐рди рдирд╣реАрдВ рдХрд░ рд╕рдХрддреЗ, рддреЛ рдпреЗ рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реБрд░рдХреНрд╖рд╛ рдЙрдкрд╛рдп рд╣реЛ рд╕рдХрддреЗ рд╣реИрдВ:

* **IP рд╕рдлреЗрдж рд╕реВрдЪреА** -- рдЖрдкрдХреЛ рдПрдХ рдорд╛рдиреНрдп IP рдХрдВрдкреНрд░рдорд╛рдЗрдЬрд╝ рдХрд░рдирд╛ рд╣реЛрдЧрд╛
* **рднреВрдЧреЛрд▓рд┐рдХ рдкреНрд░рддрд┐рдмрдВрдз** -- рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХрд╣рд╛рдБ рд░рд╣рддрд╛ рд╣реИ рдпрд╛ рдХрдВрдкрдиреА рдХреЗ рдХрд╛рд░реНрдпрд╛рд▓рдп рдХрд╣рд╛рдБ рд╣реИрдВ рдФрд░ рдЙрд╕реА рд╢рд╣рд░ рд╕реЗ IP рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ (рдХрдо рд╕реЗ рдХрдо рдЙрд╕реА рд╢рд╣рд░ рдХрд╛ рдпрд╛ рджреЗрд╢ рдХрд╛)
* **рдмреНрд░рд╛рдЙрдЬрд╝рд░** -- рд╢рд╛рдпрдж рдХреЗрд╡рд▓ рдХреБрдЫ рдСрдкрд░реЗрдЯрд┐рдВрдЧ рд╕рд┐рд╕реНрдЯрдо (рд╡рд┐рдВрдбреЛрдЬ, рд▓рд┐рдирдХреНрд╕, рдореИрдХ, рдПрдВрдбреНрд░реЙрдпрдб, рдЖрдИрдУрдПрд╕) рдХрд╛ рдмреНрд░рд╛рдЙрдЬрд╝рд░ рдЕрдиреБрдордд рд╣реИред рдкреАрдбреАрдПрдлрд╝ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░реЗрдВ рдЬрд┐рд╕рдореЗрдВ рд╡рд┐рдХреНрдЯрд┐рдо/рдХрдВрдкрдиреА рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд┐рдпрд╛ рдЬрд╛рдиреЗ рд╡рд╛рд▓рд╛ рдСрдкрд░реЗрдЯрд┐рдВрдЧ рд╕рд┐рд╕реНрдЯрдо рд╣реИред
* рдЖрдк рдпрд╣ рднреА рдХреЛрд╢рд┐рд╢ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ **рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдХрдВрдкреНрд░рдорд╛рдЗрдЬ** рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХреНрдпреЛрдВрдХрд┐ рд╡реЗ рд╕рд╛рдорд╛рдиреНрдпрдд: рдХрдо рд╕реАрдорд┐рдд рд╣реЛрддреЗ рд╣реИрдВ рдФрд░ рдЙрд╕рдХрд╛ рд▓реЙрдЧрд┐рди рдХрдо рд╕рдореАрдХреНрд╖рд┐рдд рд╣реЛрддрд╛ рд╣реИ

рдЗрд╕реЗ рдЙрд▓реНрд▓рдВрдШрди рдХрд░рдиреЗ рдХреЗ рдмрд╛рдж, рдЖрдк рдЕрдкрдиреЗ рдкреНрд░рд╛рд░рдВрднрд┐рдХ рд╕реЗрдЯрдЕрдк рдкрд░ рд╡рд╛рдкрд╕ рдЬрд╛ рд╕рдХрддреЗ рд╣реИрдВ рдФрд░ рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрднреА рднреА рдкрд╣реБрдВрдЪ рд╣реЛрдЧреАред

### рд╕рдмрдбреЛрдореЗрди рддрд╛рдХрдирдУрд╡рд░

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
рдЬрд╛рдиреЗрдВ рдХрд┐ **рдХреИрд╕реЗ рд╕реНрдерд╛рдкрд┐рдд рдХрд░реЗрдВ** az cli, AzureAD рдФрд░ Az PowerShell рдХреЛ [**Az - AzureAD**](az-azuread/) рдЦрдВрдб рдореЗрдВред
{% endhint %}

рдкрд╣рд▓реА рдЪреАрдЬ рдЬреЛ рдЖрдкрдХреЛ рдкрддрд╛ рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП рд╣реИ **рдЖрдк рдХреМрди рд╣реИрдВ** (рдХрд┐рд╕ рдкрд░рд┐рд╡реЗрд╢ рдореЗрдВ рд╣реИрдВ):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}рд╣реИрдХрд░реНрд╕ рдЖрдорддреМрд░ рдкрд░ Azure AD рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдХреЛ рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╕реЛрд╢рд▓ рдЗрдВрдЬреАрдирд┐рдпрд░рд┐рдВрдЧ рддрдХрдиреАрдХ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рддреЗ рд╣реИрдВ, рдЬреИрд╕реЗ рдлрд┐рд╢рд┐рдВрдЧ рдпрд╛ рдлреЗрдХ рд▓реЙрдЧрд┐рди рдкреЗрдЬреНрд╕ред рдЗрд╕рдХреЗ рдЕрд▓рд╛рд╡рд╛, рд╡реЗ рдмреНрд░реВрдЯ рдлреЛрд░реНрд╕ рдЕрдЯреИрдХ рдпрд╛ рд░реЗрдиреНрдбрдо рдкрд╛рд╕рд╡рд░реНрдб рдЬрдирд░реЗрд╢рди рдХрд╛ рднреА рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред{% endtab %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}рд╣рдо рдЕрдкрдиреЗ Azure рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдХреЗ рд╕рд╛рде рдХрд╛рдо рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП Az PowerShell рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред рдЗрд╕рдХреЗ рд▓рд┐рдП, рд╣рдореЗрдВ Az PowerShell рдореЙрдбреНрдпреВрд▓ рдХреЛ рдЗрдирд╕реНрдЯреЙрд▓ рдХрд░рдирд╛ рд╣реЛрдЧрд╛ рдФрд░ рдлрд┐рд░ рд▓реЙрдЧрд┐рди рдХрд░рдирд╛ рд╣реЛрдЧрд╛ред рдЗрд╕рдХреЗ рдмрд╛рдж, рд╣рдо Azure рд╕реЗрд╡рд╛рдУрдВ рдХреЛ рдкреНрд░рдмрдВрдзрд┐рдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП PowerShell рдХрдорд╛рдВрдбреНрд╕ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред{% endtab %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
рдПрдЬрд╝реНрдпреВрд░ рдХреЛ рдПрдиреБрдорд░реЗрдЯ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдорд╣рддреНрд╡рдкреВрд░реНрдг рдХрдорд╛рдВрдб рдореЗрдВ рд╕реЗ рдПрдХ рд╣реИ **`Get-AzResource`** рдЬреЛ Az PowerShell рд╕реЗ рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдпрд╣ рдЖрдкрдХреЛ **рдЬрд╛рдирдиреЗ рдХреА рдЕрдиреБрдорддрд┐ рджреЗрддрд╛ рд╣реИ рдХрд┐ рдЖрдкрдХреЗ рд╡рд░реНрддрдорд╛рди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХрд┐рд╕ рд╕рдВрд╕рд╛рдзрди рдХреЛ рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВ**ред

рдЖрдк **рд╡реЗрдм рдХреЙрдиреНрд╕реЛрд▓** рдореЗрдВ рднреА рдПрдХ рд╣реА рдЬрд╛рдирдХрд╛рд░реА рдкреНрд░рд╛рдкреНрдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) рдЬрд╛рдХрд░ рдпрд╛ "рд╕рднреА рд╕рдВрд╕рд╛рдзрди" рдХреА рдЦреЛрдЬ рдХрд░рдХреЗред
{% endhint %}

### AzureAD рдПрдиреБрдорд░реЗрд╢рди

рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ рдЪреАрдЬреЛрдВ рдХреЛ рдПрдиреБрдорд░реЗрдЯ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдкрд░реНрдпрд╛рдкреНрдд рдЕрдиреБрдорддрд┐ рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП, рдЬреИрд╕реЗ рдХрд┐, рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛рдУрдВ, рд╕рдореВрд╣реЛрдВ, рднреВрдорд┐рдХрд╛рдПрдБ, рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓реНрд╕... (рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдПрдЬрд╝реНрдпреВрд░рдПрдбреА рдЕрдиреБрдорддрд┐рдпреЛрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░реЗрдВ [рдбрд┐рдлрд╝реЙрд▓реНрдЯ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдЕрдиреБрдорддрд┐рдпрд╛рдБ](az-basic-information.md#default-user-permissions))ред\
рдЖрдк рдпрд╣рд╛рдБ рдПрдХ рдЧрд╛рдЗрдб рдкрд╛ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
рдЕрдм рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрдкрдиреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рд╣реИ** (рдФрд░ рдпрджрд┐ рдЖрдк рдПрдХ рд░реЗрдб рдЯреАрдо рд╣реИрдВ рддреЛ рдЖрд╢рд╛ рд╣реИ рдХрд┐ рдЖрдкрдХреЛ **рдкрд╣рдЪрд╛рди рдирд╣реАрдВ рд▓реА рдЧрдИ рд╣реИ**). рддреЛ рдпрд╣ рд╕рдордп рд╣реИ рдХрд┐ рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рд╡рд╛рддрд╛рд╡рд░рдг рдореЗрдВ рдХреМрди рд╕реА рд╕реЗрд╡рд╛рдПрдВ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВред\
рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рдЦрдВрдб рдореЗрдВ рдЖрдк рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реЗрд╡рд╛рдУрдВ рдХреЛ **рдПрдиреБрдорд░реЗрдЯ рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рддрд░реАрдХреЗ рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВ**ред
{% endhint %}

## рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓ рдФрд░ рдПрдХреНрд╕реЗрд╕ рдиреАрддрд┐

рдПрдХ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗрд╡рд╛ рдореЗрдВ рдПрдХ рд╕рд┐рд╕реНрдЯрдо рдкрд╣рдЪрд╛рди (рд╕реЗрд╡рд╛ рдЦреБрдж рдХреА) рд╣реЛ рд╕рдХрддреА рд╣реИ рдпрд╛ рдПрдХ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдирд┐рд░реНрдзрд╛рд░рд┐рдд рдкреНрд░рдмрдВрдзрд┐рдд рдкрд╣рдЪрд╛рди рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреА рд╣реИред рдЗрд╕ рдкрд╣рдЪрд╛рди рдХреЛ, рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП, рдПрдХ KeyVault рдореЗрдВ рд░рд╣рд╕реНрдп рдкрдврд╝рдиреЗ рдХреЗ рд▓рд┐рдП рдПрдХреНрд╕реЗрд╕ рдиреАрддрд┐ рд╣реЛ рд╕рдХрддреА рд╣реИред рдпреЗ рдПрдХреНрд╕реЗрд╕ рдиреАрддрд┐рдпрд╛рдБ рдкреНрд░рддрд┐рдмрдВрдзрд┐рдд рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП (рдХрдо рд╕реБрд╡рд┐рдзрд╛ рд╕рд┐рджреНрдзрд╛рдВрдд), рд▓реЗрдХрд┐рди рдЬрд░реВрд░рдд рд╕реЗ рдЕрдзрд┐рдХ рдЕрдиреБрдорддрд┐рдпрд╛рдБ рд╣реЛ рд╕рдХрддреА рд╣реИрдВред рд╕рд╛рдорд╛рдиреНрдпрдд: рдПрдХ рдРрдк рд╕реЗрд╡рд╛ KeyVault рдХрд╛ рдЙрдкрдпреЛрдЧ рд░рд╣рд╕реНрдп рдФрд░ рдкреНрд░рдорд╛рдгрдкрддреНрд░ рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд░реЗрдЧреАред

рдЗрд╕рд▓рд┐рдП рдЗрди рдкрд╣рдЪрд╛рдиреЛрдВ рдХрд╛ рдЕрдиреНрд╡реЗрд╖рдг рдХрд░рдирд╛ рдЙрдкрдпреЛрдЧреА рд╣реИред

## рдРрдк рд╕реЗрд╡рд╛ SCM

рдРрдк рд╕реЗрд╡рд╛ 'рдХрдВрдЯреЗрдирд░' рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХреБрдбреВ рдХрдВрд╕реЛрд▓ред

## рд╡реЗрдмрд╢реИрд▓

рд╡реЗрдмрд╢реИрд▓ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ portal.azure.com рдФрд░ рд╢реИрд▓ рдХрд╛ рдЪрдпрди рдХрд░реЗрдВ, рдпрд╛ рд╢реИрд▓.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ, рдПрдХ рдмреИрд╢ рдпрд╛ рдкрд╛рд╡рд░рд╢реИрд▓ рдХреЗ рд▓рд┐рдПред рдЗрд╕ рд╢реИрд▓ рдХреА 'рдбрд┐рд╕реНрдХ' рдХреЛ рдПрдХ рдЫрд╡рд┐ рдлрд╝рд╛рдЗрд▓ рдХреЗ рд░реВрдк рдореЗрдВ рдПрдХ рд╕реНрдЯреЛрд░реЗрдЬ-рдЕрдХрд╛рдЙрдВрдЯ рдореЗрдВ рд╕рдВрдЧреНрд░рд╣рд┐рдд рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## рдПрдЬрд╝реНрдпреВрд░ рдбреЗрд╡рдСрдкреНрд╕

рдПрдЬрд╝реНрдпреВрд░ рдбреЗрд╡рдСрдкреНрд╕ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗ рдЕрд▓рдЧ рд╣реИред рдЗрд╕рдореЗрдВ рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА, рдкрд╛рдЗрдкрд▓рд╛рдЗрди (yaml рдпрд╛ рд░рд┐рд▓реАрдЬ), рдмреЛрд░реНрдб, рд╡рд┐рдХрд┐, рдФрд░ рдЕрдзрд┐рдХ рд╣реИред рд╡реЗрд░рд┐рдПрдмрд▓ рдЧреНрд░реБрдкреНрд╕ рдХрд╛ рдЙрдкрдпреЛрдЧ рдорд╛рдиреНрдпрддрд╛ рдорд╛рдиреЛрдВ рдФрд░ рд░рд╣рд╕реНрдпреЛрдВ рдХреЛ рд╕рдВрдЧреНрд░рд╣рд┐рдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рд░реАрдХреЙрди рдЯреВрд▓реНрд╕

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**рдПрдЬрд╝реНрдпреВрд░рд╣рд╛рдЙрдВрдб**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the тАШContributorтАЩ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [рдЖрдЬрд╝реБрдХрд╛рд░](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**рдорд╛рдЗрдХреНрд░реЛрдмрд░реНрд╕реНрдЯ**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>рдЬрд╛рдиреЗрдВ AWS рд╣реИрдХрд┐рдВрдЧ рдХреЛ рд╢реВрдиреНрдп рд╕реЗ рд╣реАрд░реЛ рддрдХ</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong> рдХреЗ рд╕рд╛рде!</strong></summary>

рджреВрд╕рд░реЗ рддрд░реАрдХреЗ HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП:

* рдЕрдЧрд░ рдЖрдк рдЕрдкрдиреА **рдХрдВрдкрдиреА рдХрд╛ рд╡рд┐рдЬреНрдЮрд╛рдкрди HackTricks рдореЗрдВ рджреЗрдЦрдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рдпрд╛ **HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рддреЛ [**рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдкреНрд▓рд╛рдиреНрд╕**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS & HackTricks рд╕реНрд╡реИрдЧ**](https://peass.creator-spring.com) рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* рд╣рдорд╛рд░реЗ рд╡рд┐рд╢реЗрд╖ [**NFTs**](https://opensea.io/collection/the-peass-family) рдХрд▓реЗрдХреНрд╢рди, [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдЦреЛрдЬреЗрдВ
* **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдпрд╛ рд╣рдореЗрдВ **Twitter** ЁЯРж [**@hacktricks_live**](https://twitter.com/hacktricks_live)** рдкрд░ рдлреЙрд▓реЛ** рдХрд░реЗрдВред
* **рдЕрдкрдиреЗ рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ, HackTricks** рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВ PRs рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗред

</details>
