# Azure рдкреЗрдВрдЯреЗрд╕реНрдЯрд┐рдВрдЧ

<details>

<summary><strong>AWS рд╣реИрдХрд┐рдВрдЧ рд╕реАрдЦреЗрдВ рд╢реВрдиреНрдп рд╕реЗ рд▓реЗрдХрд░ рд╣реАрд░реЛ рддрдХ</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong> рдХреЗ рд╕рд╛рде!</strong></summary>

HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рдиреЗ рдХреЗ рдЕрдиреНрдп рддрд░реАрдХреЗ:

* рдпрджрд┐ рдЖрдк рдЪрд╛рд╣рддреЗ рд╣реИрдВ рдХрд┐ рдЖрдкрдХреА **рдХрдВрдкрдиреА рдХрд╛ рд╡рд┐рдЬреНрдЮрд╛рдкрди HackTricks рдореЗрдВ рджрд┐рдЦрд╛рдИ рджреЗ** рдпрд╛ **HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░реЗрдВ**, рддреЛ [**рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдкреНрд▓рд╛рдиреНрд╕**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS & HackTricks рд╕реНрд╡реИрдЧ**](https://peass.creator-spring.com) рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдХреА рдЦреЛрдЬ рдХрд░реЗрдВ, рд╣рдорд╛рд░рд╛ рд╡рд┐рд╢реЗрд╖ [**NFTs**](https://opensea.io/collection/the-peass-family) рд╕рдВрдЧреНрд░рд╣
* ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдореЗрдВ **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдореЗрдВ рдпрд╛ **Twitter** рдкрд░ ЁЯРж [**@carlospolopm**](https://twitter.com/carlospolopm) рдХреЛ **рдлреЙрд▓реЛ рдХрд░реЗрдВ**.
* **рдЕрдкрдиреА рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ PRs рдЬрдорд╛ рдХрд░рдХреЗ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВ.

</details>

## рдореИрдВ рдЕрднреА рднреА AZURE METHODOLOGY рдмрдирд╛ рд░рд╣рд╛ рд╣реВрдБ

## рдореВрд▓ рдЬрд╛рдирдХрд╛рд░реА

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure рдкреЗрдВрдЯреЗрд╕реНрдЯрд░/рд░реЗрдб рдЯреАрдо рдореЗрдереЛрдбреЛрд▓реЙрдЬреА

AZURE рдкрд░реНрдпрд╛рд╡рд░рдг рдХрд╛ рдСрдбрд┐рдЯ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдпрд╣ рдЬрд╛рдирдирд╛ рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ: рдХреМрди рд╕реА **рд╕реЗрд╡рд╛рдПрдВ рдЗрд╕реНрддреЗрдорд╛рд▓ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВ**, рдХреНрдпрд╛ **рдЙрдЬрд╛рдЧрд░ рдХрд┐рдпрд╛ рдЬрд╛ рд░рд╣рд╛ рд╣реИ**, рдХрд┐рд╕рдХреЗ рдкрд╛рд╕ рдХрд┐рд╕ рдЪреАрдЬрд╝ рдХреА **рдкрд╣реБрдБрдЪ** рд╣реИ, рдФрд░ рдХреИрд╕реЗ рдЖрдВрддрд░рд┐рдХ Azure рд╕реЗрд╡рд╛рдПрдВ рдФрд░ **рдмрд╛рд╣рд░реА рд╕реЗрд╡рд╛рдПрдВ** рдЬреБрдбрд╝реА рд╣реБрдИ рд╣реИрдВред

рд░реЗрдб рдЯреАрдо рдХреЗ рджреГрд╖реНрдЯрд┐рдХреЛрдг рд╕реЗ, Azure рдкрд░реНрдпрд╛рд╡рд░рдг рдХреЛ рд╕рдордЭреМрддрд╛ рдХрд░рдиреЗ рдХрд╛ **рдкрд╣рд▓рд╛ рдХрджрдо** Azure AD рдХреЗ рд▓рд┐рдП рдХреБрдЫ **рдкреНрд░рдорд╛рдг-рдкрддреНрд░** рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ рд╣реИред рдпрд╣рд╛рдБ рдХреБрдЫ рд╡рд┐рдЪрд╛рд░ рд╣реИрдВ рдХрд┐ рдЖрдк рдРрд╕рд╛ рдХреИрд╕реЗ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

* github (рдпрд╛ рдЗрд╕реА рддрд░рд╣ рдХреЗ) рдореЗрдВ **рд▓реАрдХ** - OSINT
* **рд╕рд╛рдорд╛рдЬрд┐рдХ** рдЗрдВрдЬреАрдирд┐рдпрд░рд┐рдВрдЧ
* **рдкрд╛рд╕рд╡рд░реНрдб** рдкреБрди: рдЙрдкрдпреЛрдЧ (рдкрд╛рд╕рд╡рд░реНрдб рд▓реАрдХ)
* Azure-Hosted рдПрдкреНрд▓рд┐рдХреЗрд╢рдиреНрд╕ рдореЗрдВ рднреЗрджреНрдпрддрд╛рдПрдВ
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) рдореЗрдЯрд╛рдбреЗрдЯрд╛ рдПрдВрдбрдкреЙрдЗрдВрдЯ рддрдХ рдкрд╣реБрдБрдЪ рдХреЗ рд╕рд╛рде
* **Local File Read**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* 2.30 рд╕реЗ рдкрд╣рд▓реЗ `az cli` рдореЗрдВ **`accessTokens.json`** рдлрд╝рд╛рдЗрд▓ - Jan2022 - рд╕реНрдкрд╖реНрдЯ рдкрд╛рда рдореЗрдВ **рдкрд╣реБрдБрдЪ рдЯреЛрдХрди** рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рддреА рдереА
* **`azureProfile.json`** рдлрд╝рд╛рдЗрд▓ рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд┐рдП рдЧрдП рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдЬрд╛рдирдХрд╛рд░реА** рд╣реЛрддреА рд╣реИред
* **`az logout`** рдЯреЛрдХрди рдХреЛ рд╣рдЯрд╛ рджреЗрддрд╛ рд╣реИред
* рдкреБрд░рд╛рдиреЗ рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдореЗрдВ **`Az PowerShell`** рд╕реНрдкрд╖реНрдЯ рдкрд╛рда рдореЗрдВ **рдкрд╣реБрдБрдЪ рдЯреЛрдХрди** рдХреЛ **`TokenCache.dat`** рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рддрд╛ рдерд╛ред рдпрд╣ **`AzureRmContext.json`** рдореЗрдВ **ServicePrincipalSecret** рдХреЛ рднреА рд╕реНрдкрд╖реНрдЯ-рдкрд╛рда рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рддрд╛ рд╣реИред **`Save-AzContext`** cmdlet рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ **рдЯреЛрдХрди** рдХреЛ **рд╕рдВрдЧреНрд░рд╣реАрдд** рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред\
рдЙрдиреНрд╣реЗрдВ рд╣рдЯрд╛рдиреЗ рдХреЗ рд▓рд┐рдП `Disconnect-AzAccount` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред
* рддреГрддреАрдп рдкрдХреНрд╖ **рдЙрд▓реНрд▓рдВрдШрди**
* **рдЖрдВрддрд░рд┐рдХ** рдХрд░реНрдордЪрд╛рд░реА
* [**рд╕рд╛рдорд╛рдиреНрдп рдлрд╝рд┐рд╢рд┐рдВрдЧ**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (рдкреНрд░рдорд╛рдг-рдкрддреНрд░ рдпрд╛ Oauth рдРрдк)
* [Device Code Authentication Phishing](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

рдпрд╣рд╛рдВ рддрдХ рдХрд┐ рдпрджрд┐ рдЖрдкрдиреЗ Azure рдЯреЗрдиреЗрдВрдЯ рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ рд╕рдордЭреМрддрд╛ рдирд╣реАрдВ рдХрд┐рдпрд╛ рд╣реИ рдЬрд┐рд╕ рдкрд░ рдЖрдк рд╣рдорд▓рд╛ рдХрд░ рд░рд╣реЗ рд╣реИрдВ, рдЖрдк рдЗрд╕рд╕реЗ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА **рдПрдХрддреНрд░ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ**:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
рдЬрдм рдЖрдк рдкреНрд░рдорд╛рдг-рдкрддреНрд░ рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдореЗрдВ рд╕рдлрд▓ рд╣реЛ рдЬрд╛рддреЗ рд╣реИрдВ, рддреЛ рдЖрдкрдХреЛ рдпрд╣ рдЬрд╛рдирдирд╛ рд╣реЛрдЧрд╛ рдХрд┐ **рдЙрди рдкреНрд░рдорд╛рдг-рдкрддреНрд░реЛрдВ рдХрд╛ рдорд╛рд▓рд┐рдХ рдХреМрди рд╣реИ**, рдФрд░ **рдЙрдирдХреА рдкрд╣реБрдБрдЪ рдХрд┐рд╕ рдЪреАрдЬрд╝ рддрдХ рд╣реИ**, рдЗрд╕рд▓рд┐рдП рдЖрдкрдХреЛ рдХреБрдЫ рдореВрд▓рднреВрдд рдкрд░рд┐рдЧрдгрдирд╛ рдХрд░рдиреА рд╣реЛрдЧреА:
{% endhint %}

## рдореВрд▓рднреВрдд рдкрд░рд┐рдЧрдгрдирд╛

{% hint style="info" %}
рдпрд╛рдж рд░рдЦреЗрдВ рдХрд┐ рдкрд░рд┐рдЧрдгрдирд╛ рдХрд╛ **рд╕рдмрд╕реЗ рдЕрдзрд┐рдХ рд╢реЛрд░** рд╡рд╛рд▓рд╛ рд╣рд┐рд╕реНрд╕рд╛ **рд▓реЙрдЧрд┐рди** рд╣реИ, рдкрд░рд┐рдЧрдгрдирд╛ рд╕реНрд╡рдпрдВ рдирд╣реАрдВред
{% endhint %}

### SSRF

рдпрджрд┐ рдЖрдкрдиреЗ Azure рдХреЗ рдЕрдВрджрд░ рдХрд┐рд╕реА рдорд╢реАрди рдореЗрдВ SSRF рдкрд╛рдпрд╛ рд╣реИ рддреЛ рдЪрд╛рд▓реЛрдВ рдХреЗ рд▓рд┐рдП рдЗрд╕ рдкреГрд╖реНрда рдХреЛ рджреЗрдЦреЗрдВ:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### рд▓реЙрдЧрд┐рди рд╢рд░реНрддреЛрдВ рдХреЛ рдмрд╛рдпрдкрд╛рд╕ рдХрд░рдирд╛

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

рдЬрд┐рди рдорд╛рдорд▓реЛрдВ рдореЗрдВ рдЖрдкрдХреЗ рдкрд╛рд╕ рдХреБрдЫ рдорд╛рдиреНрдп рдкреНрд░рдорд╛рдг-рдкрддреНрд░ рд╣реИрдВ рд▓реЗрдХрд┐рди рдЖрдк рд▓реЙрдЧрд┐рди рдирд╣реАрдВ рдХрд░ рд╕рдХрддреЗ, рдпреЗ рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реБрд░рдХреНрд╖рд╛ рд╣реЛ рд╕рдХрддреА рд╣реИрдВ рдЬреЛ рдЬрдЧрд╣ рдореЗрдВ рд╣реЛ рд╕рдХрддреА рд╣реИрдВ:

* **IP рд╡реНрд╣рд╛рдЗрдЯрд▓рд┐рд╕реНрдЯрд┐рдВрдЧ** -- рдЖрдкрдХреЛ рдПрдХ рдорд╛рдиреНрдп IP рд╕рдордЭреМрддрд╛ рдХрд░рдирд╛ рд╣реЛрдЧрд╛
* **рднреМрдЧреЛрд▓рд┐рдХ рдкреНрд░рддрд┐рдмрдВрдз** -- рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХрд╣рд╛рдБ рд░рд╣рддрд╛ рд╣реИ рдпрд╛ рдХрдВрдкрдиреА рдХреЗ рдХрд╛рд░реНрдпрд╛рд▓рдп рдХрд╣рд╛рдБ рд╣реИрдВ рдФрд░ рдЙрд╕реА рд╢рд╣рд░ рд╕реЗ (рдпрд╛ рдХрдо рд╕реЗ рдХрдо рджреЗрд╢ рд╕реЗ) рдПрдХ IP рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* **рдмреНрд░рд╛рдЙрдЬрд╝рд░** -- рд╢рд╛рдпрдж рдХреЗрд╡рд▓ рдХрд┐рд╕реА рд╡рд┐рд╢реЗрд╖ OS (Windows, Linux, Mac, Android, iOS) рд╕реЗ рдмреНрд░рд╛рдЙрдЬрд╝рд░ рдХреА рдЕрдиреБрдорддрд┐ рд╣реИред рдкрддрд╛ рд▓рдЧрд╛рдПрдВ рдХрд┐ рдкреАрдбрд╝рд┐рдд/рдХрдВрдкрдиреА рдХреМрди рд╕рд╛ OS рдЙрдкрдпреЛрдЧ рдХрд░рддреА рд╣реИред
* рдЖрдк Service Principal рдкреНрд░рдорд╛рдг-рдкрддреНрд░реЛрдВ рдХреЛ рд╕рдордЭреМрддрд╛ рдХрд░рдиреЗ рдХреА рднреА рдХреЛрд╢рд┐рд╢ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ рдХреНрдпреЛрдВрдХрд┐ рд╡реЗ рдЖрдорддреМрд░ рдкрд░ рдХрдо рд╕реАрдорд┐рдд рд╣реЛрддреЗ рд╣реИрдВ рдФрд░ рдЙрдирдХрд╛ рд▓реЙрдЧрд┐рди рдХрдо рд╕рдореАрдХреНрд╖рд╛ рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИ

рдЗрд╕реЗ рдмрд╛рдпрдкрд╛рд╕ рдХрд░рдиреЗ рдХреЗ рдмрд╛рдж, рдЖрдк рдЕрдкрдиреА рдкреНрд░рд╛рд░рдВрднрд┐рдХ рд╕реЗрдЯрдЕрдк рдкрд░ рд╡рд╛рдкрд╕ рдЬрд╛ рд╕рдХрддреЗ рд╣реИрдВ рдФрд░ рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрднреА рднреА рдкрд╣реБрдБрдЪ рд╣реЛрдЧреАред

### рд╕рдмрдбреЛрдореЗрди рдЯреЗрдХрдУрд╡рд░

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
рдЬрд╛рдиреЗрдВ **рдХреИрд╕реЗ рдЗрдВрд╕реНрдЯреЙрд▓ рдХрд░реЗрдВ** az cli, AzureAD рдФрд░ Az PowerShell [**Az - AzureAD**](az-azuread/) рд╕реЗрдХреНрд╢рди рдореЗрдВред
{% endhint %}

рдЖрдкрдХреЛ рдкрд╣рд▓реА рдмрд╛рдд рдпрд╣ рдЬрд╛рдирдиреА рд╣реЛрдЧреА рдХрд┐ рдЖрдк **рдХреМрди рд╣реИрдВ** (рдЖрдк рдХрд┐рд╕ рдкрд░реНрдпрд╛рд╡рд░рдг рдореЗрдВ рд╣реИрдВ):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
```
{% endtab %}

{% tab title="AzureAD" %}
```
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
```
{% endtab %}

{% tab title="Az PowerShell" %}
```
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Azure рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдорд╣рддреНрд╡рдкреВрд░реНрдг рдХрдорд╛рдВрдбреНрд╕ рдореЗрдВ рд╕реЗ рдПрдХ **`Get-AzResource`** рд╣реИ, рдЬреЛ Az PowerShell рд╕реЗ рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдпрд╣ рдЖрдкрдХреЛ **рдЙрди рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреА рдЬрд╛рдирдХрд╛рд░реА рджреЗрддрд╛ рд╣реИ рдЬрд┐рди рдкрд░ рдЖрдкрдХреЗ рд╡рд░реНрддрдорд╛рди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреА рджреГрд╢реНрдпрддрд╛ рд╣реИ**ред

рдЖрдк **рд╡реЗрдм рдХрдВрд╕реЛрд▓** рдореЗрдВ рдЬрд╛рдХрд░ [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) рдкрд░ рдпрд╛ "All resources" рдХреА рдЦреЛрдЬ рдХрд░рдХреЗ рд╕рдорд╛рди рдЬрд╛рдирдХрд╛рд░реА рдкреНрд░рд╛рдкреНрдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред
{% endhint %}

### AzureAD рд╕реВрдЪреАрдмрджреНрдзрддрд╛

рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдкрд╛рд╕ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛рдУрдВ, рд╕рдореВрд╣реЛрдВ, рднреВрдорд┐рдХрд╛рдУрдВ, рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓реЛрдВ рдЖрджрд┐ рдХреЛ рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП **рдкрд░реНрдпрд╛рдкреНрдд рдЕрдиреБрдорддрд┐рдпрд╛рдВ рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП** (рджреЗрдЦреЗрдВ [рдбрд┐рдлрд╝реЙрд▓реНрдЯ AzureAD рдЕрдиреБрдорддрд┐рдпрд╛рдВ](az-basic-information.md#default-user-permissions))ред\
рдЖрдк рдпрд╣рд╛рдВ рдПрдХ рдЧрд╛рдЗрдб рдкрд╛ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
рдЕрдм рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрдкрдиреА рдкреНрд░рдорд╛рдгрд┐рдХрддрд╛рдУрдВ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рд╣реИ** (рдФрд░ рдпрджрд┐ рдЖрдк рдПрдХ рд░реЗрдб рдЯреАрдо рд╣реИрдВ рддреЛ рдЖрд╢рд╛ рд╣реИ рдХрд┐ рдЖрдк **рдкрддрд╛ рдирд╣реАрдВ рдЪрд▓реЗ рд╣реИрдВ**), рддреЛ рдпрд╣ рд╕рдордп рд╣реИ рдХрд┐ рдкрддрд╛ рд▓рдЧрд╛рдпрд╛ рдЬрд╛рдП рдХрд┐ рдХреМрди рд╕реА рд╕реЗрд╡рд╛рдПрдВ рдкрд░реНрдпрд╛рд╡рд░рдг рдореЗрдВ рдЗрд╕реНрддреЗрдорд╛рд▓ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВред\
рдЖрдЧрд╛рдореА рдЦрдВрдб рдореЗрдВ рдЖрдк рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реЗрд╡рд╛рдУрдВ рдХреЛ **рд╕реВрдЪреАрдмрджреНрдз рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рддрд░реАрдХреЗ** рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВред
{% endhint %}

## рд╕реЗрд╡рд╛ рдкреНрд░рд┐рдВрд╕рд┐рдкрд▓ рдФрд░ рдПрдХреНрд╕реЗрд╕ рдкреЙрд▓рд┐рд╕реА

рдПрдХ Azure рд╕реЗрд╡рд╛ рдХреЗ рдкрд╛рд╕ рдЦреБрдж рдХреА рд╕рд┐рд╕реНрдЯрдо рдкрд╣рдЪрд╛рди (System Identity) рд╣реЛ рд╕рдХрддреА рд╣реИ рдпрд╛ рдПрдХ рдпреВрдЬрд░ рдЕрд╕рд╛рдЗрдиреНрдб рдореИрдиреЗрдЬреНрдб рдЖрдЗрдбреЗрдВрдЯрд┐рдЯреА рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░ рд╕рдХрддреА рд╣реИред рдЗрд╕ рдЖрдЗрдбреЗрдВрдЯрд┐рдЯреА рдХреЗ рдкрд╛рд╕ рдПрдХреНрд╕реЗрд╕ рдкреЙрд▓рд┐рд╕реА рд╣реЛ рд╕рдХрддреА рд╣реИ, рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП, KeyVault рдХреЗ рд▓рд┐рдП рдЧреБрдкреНрдд рд╕реВрдЪрдирд╛рдУрдВ рдХреЛ рдкрдврд╝рдиреЗ рдХреЗ рд▓рд┐рдПред рдЗрди рдПрдХреНрд╕реЗрд╕ рдкреЙрд▓рд┐рд╕рд┐рдпреЛрдВ рдХреЛ рдкреНрд░рддрд┐рдмрдВрдзрд┐рдд (рдиреНрдпреВрдирддрдо рд╡рд┐рд╢реЗрд╖рд╛рдзрд┐рдХрд╛рд░ рд╕рд┐рджреНрдзрд╛рдВрдд) рд╣реЛрдирд╛ рдЪрд╛рд╣рд┐рдП, рд▓реЗрдХрд┐рди рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╕реЗ рдЕрдзрд┐рдХ рдЕрдиреБрдорддрд┐рдпрд╛рдВ рд╣реЛ рд╕рдХрддреА рд╣реИрдВред рдЖрдорддреМрд░ рдкрд░ рдПрдХ рдРрдк рд╕рд░реНрд╡рд┐рд╕ KeyVault рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдЧреБрдкреНрдд рд╕реВрдЪрдирд╛рдПрдВ рдФрд░ рдкреНрд░рдорд╛рдгрдкрддреНрд░ рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдЧреАред

рдЗрд╕рд▓рд┐рдП рдЗрди рдкрд╣рдЪрд╛рдиреЛрдВ рдХрд╛ рдкрддрд╛ рд▓рдЧрд╛рдирд╛ рдЙрдкрдпреЛрдЧреА рд╣реИред

## рдРрдк рд╕рд░реНрд╡рд┐рд╕ SCM

Kudu рдХрдВрд╕реЛрд▓ рдРрдк рд╕рд░реНрд╡рд┐рд╕ 'рдХрдВрдЯреЗрдирд░' рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдПред

## рд╡реЗрдмрд╢реЗрд▓

portal.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ рдФрд░ рд╢реЗрд▓ рдХрд╛ рдЪрдпрди рдХрд░реЗрдВ, рдпрд╛ shell.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ, рдмреИрд╢ рдпрд╛ рдкреЙрд╡рд░рд╢реЗрд▓ рдХреЗ рд▓рд┐рдПред рдЗрд╕ рд╢реЗрд▓ рдХреА 'рдбрд┐рд╕реНрдХ' рдПрдХ рдЗрдореЗрдЬ рдлрд╛рдЗрд▓ рдХреЗ рд░реВрдк рдореЗрдВ рдПрдХ рд╕реНрдЯреЛрд░реЗрдЬ-рдЕрдХрд╛рдЙрдВрдЯ рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рд╣реЛрддреА рд╣реИред

## Azure DevOps

Azure DevOps Azure рд╕реЗ рдЕрд▓рдЧ рд╣реИред рдЗрд╕рдореЗрдВ рд░рд┐рдкреЙрдЬрд┐рдЯрд░реАрдЬ, рдкрд╛рдЗрдкрд▓рд╛рдЗрдиреНрд╕ (yaml рдпрд╛ рд░рд┐рд▓реАрдЬ), рдмреЛрд░реНрдбреНрд╕, рд╡рд┐рдХреА, рдФрд░ рдЕрдзрд┐рдХ рд╣реИрдВред рд╡реЗрд░рд┐рдПрдмрд▓ рдЧреНрд░реБрдкреНрд╕ рдХрд╛ рдЙрдкрдпреЛрдЧ рд╡реЗрд░рд┐рдПрдмрд▓ рдорд╛рдиреЛрдВ рдФрд░ рдЧреБрдкреНрдд рд╕реВрдЪрдирд╛рдУрдВ рдХреЛ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рд░реЗрдХреЙрди рдЯреВрд▓реНрд╕

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the тАШContributorтАЩ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>AWS рд╣реИрдХрд┐рдВрдЧ рд╕реАрдЦреЗрдВ рд╢реВрдиреНрдп рд╕реЗ рд▓реЗрдХрд░ рд╣реАрд░реЛ рддрдХ</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong> рдХреЗ рд╕рд╛рде!</strong></summary>

HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░рдиреЗ рдХреЗ рдЕрдиреНрдп рддрд░реАрдХреЗ:

* рдпрджрд┐ рдЖрдк рдЪрд╛рд╣рддреЗ рд╣реИрдВ рдХрд┐ рдЖрдкрдХреА **рдХрдВрдкрдиреА рдХрд╛ рд╡рд┐рдЬреНрдЮрд╛рдкрди HackTricks рдореЗрдВ рджрд┐рдЦрд╛рдИ рджреЗ** рдпрд╛ **HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░реЗрдВ**, рддреЛ [**рд╕рдмреНрд╕рдХреНрд░рд┐рдкреНрд╢рди рдкреНрд▓рд╛рдиреНрд╕**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS & HackTricks рд╕реНрд╡реИрдЧ рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ**](https://peass.creator-spring.com)
* [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдХреА рдЦреЛрдЬ рдХрд░реЗрдВ, рд╣рдорд╛рд░рд╛ рдПрдХреНрд╕рдХреНрд▓реВрд╕рд┐рд╡ [**NFTs**](https://opensea.io/collection/the-peass-family) рд╕рдВрдЧреНрд░рд╣
* ЁЯТм [**Discord group**](https://discord.gg/hRep4RUj7f) рдореЗрдВ **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** рдпрд╛ [**telegram group**](https://t.me/peass) рдореЗрдВ рдпрд╛ **Twitter** ЁЯРж рдкрд░ рдореБрдЭреЗ **рдлреЙрд▓реЛ** рдХрд░реЗрдВ [**@carlospolopm**](https://twitter.com/carlospolopm)**.**
* **рдЕрдкрдиреА рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ, PRs рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВ.

</details>
