# рдПрдЬрд╝реНрдпреВрд░ рдкреЗрдВрдЯреЗрд╕реНрдЯрд┐рдВрдЧ

<details>

<summary><strong>рд╣реИрдХрдЯреНрд░рд┐рдХреНрд╕ рдХрд╛ рд╕рдорд░реНрдерди рдХрд░реЗрдВ рдФрд░ рд▓рд╛рдн рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ!</strong></summary>

* рдпрджрд┐ рдЖрдк рдЕрдкрдиреА рдХрдВрдкрдиреА рдХреЛ **рд╣реИрдХрдЯреНрд░рд┐рдХреНрд╕ рдореЗрдВ рд╡рд┐рдЬреНрдЮрд╛рдкрд┐рдд рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рдпрд╛ рдпрджрд┐ рдЖрдк **PEASS рдХреЗ рдирд╡реАрдирддрдо рд╕рдВрд╕реНрдХрд░рдг рджреЗрдЦрдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ рдпрд╛ HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рддреЛ [**рд╕рджрд╕реНрдпрддрд╛ рдпреЛрдЬрдирд╛рдПрдВ**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS рдФрд░ HackTricks рд╕реНрд╡реИрдЧ**](https://peass.creator-spring.com) рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдХреА рдЦреЛрдЬ рдХрд░реЗрдВ, рд╣рдорд╛рд░рд╛ рдПрдХрд▓ [**NFTs**](https://opensea.io/collection/the-peass-family) рд╕рдВрдЧреНрд░рд╣
* **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** ЁЯТм [**рдбрд┐рд╕реНрдХреЙрд░реНрдб рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдореЗрдВ рдпрд╛ **рдЯреНрд╡рд┐рдЯрд░** ЁЯРж [**@carlospolopm**](https://twitter.com/carlospolopm)** рдХрд╛** **рдЕрдиреБрд╕рд░рдг** рдХрд░реЗрдВред**
* **рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВ PR рдЬрдорд╛ рдХрд░рдХреЗред

</details>

## рдореИрдВ рдЕрднреА рдПрдЬрд╝реНрдпреВрд░ рдореЗрдердбреЛрд▓реЙрдЬреА рдмрдирд╛ рд░рд╣рд╛ рд╣реВрдБ

## рдореВрд▓рднреВрдд рдЬрд╛рдирдХрд╛рд░реА

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## рдПрдЬрд╝реНрдпреВрд░ рдкреЗрдВрдЯреЗрд╕реНрдЯрд░/рд░реЗрдб рдЯреАрдо рдореЗрдердбреЛрд▓реЙрдЬреА

рдПрдХ рдПрдЬрд╝реНрдпреВрд░ рдкрд░реНрдпрд╛рд╡рд░рдг рдХреА рдордВрдЬреВрд░реА рджреЗрдиреЗ рдХреЗ рд▓рд┐рдП рдпрд╣ рдмрд╣реБрдд рдорд╣рддреНрд╡рдкреВрд░реНрдг рд╣реИ рдХрд┐ рдЖрдк рдЬрд╛рдиреЗрдВ: рдХреМрди рд╕реА **рд╕реЗрд╡рд╛рдПрдВ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВ**, рдХреНрдпрд╛ **рдЙрдЬрд╛рдЧрд░ рд╣реЛ рд░рд╣рд╛ рд╣реИ**, рдХрд┐рд╕рдХреЗ рдкрд╛рд╕ рдХреНрдпрд╛ **рдкрд╣реБрдВрдЪ рд╣реИ**, рдФрд░ рдЖрдВрддрд░рд┐рдХ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗрд╡рд╛рдУрдВ рдФрд░ **рдмрд╛рд╣рд░реА рд╕реЗрд╡рд╛рдУрдВ** рдХрд╛ рдХреИрд╕реЗ рд╕рдВрдмрдВрдз рд╣реИред

рд░реЗрдб рдЯреАрдо рдХреЗ рджреГрд╖реНрдЯрд┐рдХреЛрдг рд╕реЗ, рдПрдЬрд╝реНрдпреВрд░ рдкрд░реНрдпрд╛рд╡рд░рдг рдХреЛ рд╕рдВрдХреНрд░рдорд┐рдд рдХрд░рдиреЗ рдХрд╛ **рдкрд╣рд▓рд╛ рдХрджрдо** рд╣реИ рдХреБрдЫ **Azure AD рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕** рдкреНрд░рд╛рдкреНрдд рдХрд░рдирд╛ред рдпрд╣рд╛рдВ рдЖрдкрдХреЛ рдХреБрдЫ рд╡рд┐рдЪрд╛рд░ рдорд┐рд▓реЗрдВрдЧреЗ рдХрд┐ рдЗрд╕реЗ рдХреИрд╕реЗ рдХрд░реЗрдВ:

* рдЧрд┐рдЯрд╣рдм (рдпрд╛ рд╕рдорд╛рди) рдореЗрдВ **рд▓реАрдХ** - OSINT
* **рд╕рд╛рдорд╛рдЬрд┐рдХ** рдЗрдВрдЬреАрдирд┐рдпрд░рд┐рдВрдЧ
* **рдкрд╛рд╕рд╡рд░реНрдб** рдкреБрди: рдЙрдкрдпреЛрдЧ (рдкрд╛рд╕рд╡рд░реНрдб рд▓реАрдХ)
* Azure-Hosted рдПрдкреНрд▓рд┐рдХреЗрд╢рди рдореЗрдВ рдХрдордЬреЛрд░рд┐рдпрд╛рдВ
* [**рд╕рд░реНрд╡рд░ рд╕рд╛рдЗрдб рд░рд┐рдХреНрд╡реЗрд╕реНрдЯ рдлрд╝реЙрд░реНрдЬрд╝рд░реА**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) рдореЗрдЯрд╛рдбреЗрдЯрд╛ рдПрдВрдбрдкреЙрдЗрдВрдЯ рддрдХ рдкрд╣реБрдВрдЪ рдХреЗ рд╕рд╛рде
* **рд╕реНрдерд╛рдиреАрдп рдлрд╝рд╛рдЗрд▓ рдкрдврд╝реЗрдВ**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* `az cli` 2.30 рд╕реЗ рдкрд╣рд▓реЗ - Jan2022 - рдореЗрдВ рдлрд╝рд╛рдЗрд▓ **`accessTokens.json`** рдореЗрдВ рдХреНрд▓рд┐рдпрд░ рдкрд╛рда рдореЗрдВ **рдПрдХреНрд╕реЗрд╕ рдЯреЛрдХрди** рд╕рдВрдЧреНрд░рд╣рд┐рдд рдХрд┐рдП рдЧрдП рдереЗ
* рдлрд╝рд╛рдЗрд▓ **`azureProfile.json`** рдореЗрдВ рд▓реЙрдЧ рдЗрди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ **рдЬрд╛рдирдХрд╛рд░реА** рд╣реЛрддреА рд╣реИред
* **`az logout`** рдЯреЛрдХрди рдХреЛ рд╣рдЯрд╛ рджреЗрддрд╛ рд╣реИред
* рдкреБрд░рд╛рдиреЗ рд╕рдВрд╕реНрдХрд░рдгреЛрдВ рдореЗрдВ **`Az PowerShell`** рдиреЗ **рдПрдХреНрд╕реЗрд╕ рдЯреЛрдХрди** рдХреЛ **рдХреНрд▓рд┐рдпрд░** рдкрд╛рда рдореЗрдВ рд╕рдВрдЧреНрд░рд╣рд┐рдд рдХрд┐рдпрд╛ред рдпрд╣ рднреА **`TokenCache.dat`** рдореЗрдВ **ServicePrincipalSecret** рдХреЛ **рдХреНрд▓рд┐рдпрд░** рдкрд╛рда рдореЗрдВ рд╕рдВрдЧреНрд░рд╣рд┐рдд рдХрд░рддрд╛ рд╣реИред рддрд╛рд░реАрдЦрд╝ рдХреНрд╖реЗрддреНрд░ **`Save-AzContext`** рдХрд╛ рдЙрдкрдпреЛрдЧ **рдЯреЛрдХрди** рдХреЛ **рд╕рдВрдЧреНрд░рд╣рд┐рдд** рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред\
рдЙрдиреНрд╣реЗрдВ рд╣рдЯрд╛рдиреЗ рдХреЗ рд▓рд┐рдП `Disconnect-AzAccount` рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред
* рдерд░реНрдб рдкрд╛рд░реНрдЯреА **рднрдВрдЧ**
* **рдЖрдВрддрд░рд┐рдХ** рдХрд░реНрдордЪрд╛рд░реА
* [**рд╕рд╛рдорд╛рдиреНрдп рдлрд┐рд╢рд┐рдВрдЧ**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓ рдпрд╛ рдУрде рдРрдк)
* [рдбрд┐рд╡рд╛рдЗрд╕ рдХреЛрдб рдкреНрд░рдорд╛рдгреАрдХрд░рдг рдлрд┐рд╢рд┐рдВрдЧ](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [рдПрдЬрд╝реНрдпреВрд░ **рдкрд╛рд╕рд╡рд░реНрдб рд╕реНрдкреНрд░реЗрдЗрдВрдЧ**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

рдпрджрд┐ рдЖрдкрдиреЗ рдЖрдкрдХреЗ рдЖрдХреНрд░рдордг рдХреЗ рд▓рдХреНрд╖реНрдп рдХреЗ рд░реВрдк рдореЗрдВ рдПрдЬрд╝реНрдпреВрд░ рдХрд┐рд░рд╛рдпреЗрджрд╛рд░ рдХреЗ рднреАрддрд░ рдХрд┐рд╕реА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ рд╕рдВрдХреНрд░рдорд┐рдд рдирд╣реАрдВ рдХрд┐рдпрд╛ рд╣реИ, рддреЛ рдЖрдк рдЙрд╕рд╕реЗ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рдПрдХрддреНрд░ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
рдЬрдм рдЖрдкрдиреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓реНрд╕ рдкреНрд░рд╛рдкреНрдд рдХрд░ рд▓рд┐рдП рд╣реЛрдВ, рддреЛ рдЖрдкрдХреЛ рдЬрд╛рдирдиреЗ рдХреА рдЖрд╡рд╢реНрдпрдХрддрд╛ рд╣реЛрдЧреА рдХрд┐ рд╡реЗ рдХрд┐рд╕рдХреЗ рд╣реИрдВ рдФрд░ рдЙрдирдХреЗ рдкрд╛рд╕ рдХреНрдпрд╛ рдкрд╣реБрдВрдЪ рд╣реИ, рдЗрд╕рд▓рд┐рдП рдЖрдкрдХреЛ рдХреБрдЫ рдореВрд▓рднреВрдд рдЬрд╛рдВрдЪ рдХрд░рдиреА рд╣реЛрдЧреА:
{% endhint %}

## рдореВрд▓рднреВрдд рдЬрд╛рдВрдЪ

{% hint style="info" %}
рдзреНрдпрд╛рди рджреЗрдВ рдХрд┐ рдЬрд╛рдВрдЪ рдХрд╛ рд╕рдмрд╕реЗ **рд╢реЛрд░рдЧреБрд▓** рднрд╛рдЧ **рд▓реЙрдЧрд┐рди** рд╣реИ, рди рдХрд┐ рдЬрд╛рдВрдЪ рдЦреБрджред
{% endhint %}

### SSRF

рдпрджрд┐ рдЖрдкрдиреЗ рдПрдЬрд╝реНрдпреВрд░ рдХреЗ рднреАрддрд░ рдХрд┐рд╕реА рдорд╢реАрди рдореЗрдВ SSRF рдкрд╛рдпрд╛ рд╣реИ, рддреЛ рдЯреНрд░рд┐рдХреНрд╕ рдХреЗ рд▓рд┐рдП рдЗрд╕ рдкреГрд╖реНрда рдХреА рдЬрд╛рдВрдЪ рдХрд░реЗрдВ:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### рд▓реЙрдЧрд┐рди рд╢рд░реНрддреЛрдВ рдХреЛ рдЙрдордЬрд╝ рдХрд░реЗрдВ

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}AzureAD
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
рдПрдЬрд╝реНрдпреВрд░ рдХреЛ рдЬрд╛рдВрдЪрдиреЗ рдХреЗ рд▓рд┐рдП рд╕рдмрд╕реЗ рдорд╣рддреНрд╡рдкреВрд░реНрдг рдХрдорд╛рдВрдбреЛрдВ рдореЗрдВ рд╕реЗ рдПрдХ рд╣реИ **`Get-AzResource`** рдЬреЛ Az PowerShell рд╕реЗ рд╣реЛрддрд╛ рд╣реИ рдХреНрдпреЛрдВрдХрд┐ рдпрд╣ рдЖрдкрдХреЛ **рд╡рд░реНрддрдорд╛рди рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЗ рджреНрд╡рд╛рд░рд╛ рджреЗрдЦреЗ рдЬрд╛ рд░рд╣реЗ рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЛ рдкрддрд╛ рд▓рдЧрд╛рдиреЗ** рдХреА рдЕрдиреБрдорддрд┐ рджреЗрддрд╛ рд╣реИред

рдЖрдк рд╡реЗрдм рдХрдВрд╕реЛрд▓ рдореЗрдВ рднреА рдПрдХ рд╣реА рдЬрд╛рдирдХрд╛рд░реА рдкреНрд░рд╛рдкреНрдд рдХрд░ рд╕рдХрддреЗ рд╣реИрдВ рдЬрд╛рдХрд░ [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) рдпрд╛ "рд╕рднреА рд╕рдВрд╕рд╛рдзрдиреЛрдВ" рдХреА рдЦреЛрдЬ рдХрд░реЗрдВ
{% endhint %}

### AzureAD рдЬрд╛рдВрдЪ

рдбрд┐рдлрд╝реЙрд▓реНрдЯ рд░реВрдк рд╕реЗ, рдХрд┐рд╕реА рднреА рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдХреЛ рдЪреАрдЬреЛрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдкрд░реНрдпрд╛рдкреНрдд рдЕрдиреБрдорддрд┐ рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП, рдЬреИрд╕реЗ рдХрд┐ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛, рд╕рдореВрд╣, рднреВрдорд┐рдХрд╛рдПрдБ, рд╕реЗрд╡рд╛ рдкреНрд░рдзрд╛рди... (рдбрд┐рдлрд╝реЙрд▓реНрдЯ AzureAD рдЕрдиреБрдорддрд┐рдпреЛрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░реЗрдВ [рдпрд╣рд╛рдВ](az-basic-information.md#default-user-permissions)).\
рдЖрдк рдпрд╣рд╛рдВ рдПрдХ рдЧрд╛рдЗрдб рджреЗрдЦ рд╕рдХрддреЗ рд╣реИрдВ:

{% content-ref url="az-services/az-azuread.md" %}
[az-azuread.md](az-services/az-azuread.md)
{% endcontent-ref %}

{% hint style="info" %}
рдЕрдм рдЬрдм рдЖрдкрдХреЗ рдкрд╛рд╕ рдЕрдкрдиреЗ рдХреНрд░реЗрдбреЗрдВрд╢рд┐рдпрд▓ рдХреЗ рдмрд╛рд░реЗ рдореЗрдВ рдХреБрдЫ рдЬрд╛рдирдХрд╛рд░реА рд╣реИ (рдФрд░ рдпрджрд┐ рдЖрдк рдПрдХ рд░реЗрдб рдЯреАрдо рд╣реИрдВ рддреЛ рдЖрд╢рд╛ рд╣реИ рдХрд┐ рдЖрдкрдХрд╛ рдкрддрд╛ рдирд╣реАрдВ рдЪрд▓рд╛ рд╣реИ). рддреЛ рдЕрдм рд╕рдордп рд╣реИ рдХрд┐ рдЖрдк рдЬрд╛рдВрдЪреЗрдВ рдХрд┐ рд╡рд╛рддрд╛рд╡рд░рдг рдореЗрдВ рдХреМрди рд╕реА рд╕реЗрд╡рд╛рдПрдВ рдЙрдкрдпреЛрдЧ рдХреА рдЬрд╛ рд░рд╣реА рд╣реИрдВред\
рдирд┐рдореНрдирд▓рд┐рдЦрд┐рдд рдЦрдВрдб рдореЗрдВ рдЖрдк рдХреБрдЫ рд╕рд╛рдорд╛рдиреНрдп рд╕реЗрд╡рд╛рдУрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░рдиреЗ рдХреЗ рдХреБрдЫ рддрд░реАрдХреЛрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред
{% endhint %}

## рд╕реЗрд╡рд╛ рдкреНрд░рдзрд╛рди рдФрд░ рдкрд╣реБрдБрдЪ рдиреАрддрд┐

рдПрдХ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗрд╡рд╛ рдХреЗ рдкрд╛рд╕ рдПрдХ рд╕рд┐рд╕реНрдЯрдо рдкрд╣рдЪрд╛рди (рд╕реЗрд╡рд╛ рдХрд╛ рдЦреБрдж рдХрд╛) рд╣реЛ рд╕рдХрддреА рд╣реИ рдпрд╛ рдЙрдкрдпреЛрдЧрдХрд░реНрддрд╛ рдирд┐рд░реНрдзрд╛рд░рд┐рдд рдкреНрд░рдмрдВрдзрд┐рдд рдкрд╣рдЪрд╛рдиреА рдЬрд╛ рд╕рдХрддреА рд╣реИред рдЗрд╕ рдкрд╣рдЪрд╛рди рдХреЗ рдкрд╛рд╕ рдПрдХ рдкрд╣реБрдБрдЪ рдиреАрддрд┐ рд╣реЛ рд╕рдХрддреА рд╣реИ, рдЙрджрд╛рд╣рд░рдг рдХреЗ рд▓рд┐рдП, рдПрдХ KeyVault рдореЗрдВ рд╕реАрдХреНрд░реЗрдЯ рдкрдврд╝рдиреЗ рдХреЗ рд▓рд┐рдПред рдпреЗ рдкрд╣реБрдБрдЪ рдиреАрддрд┐рдпрд╛рдБ рд╕реАрдорд┐рдд рд╣реЛрдиреА рдЪрд╛рд╣рд┐рдП (рдиреНрдпреВрдирддрдо рдЕрдзрд┐рдХрд╛рд░ рдХрд╛ рд╕рд┐рджреНрдзрд╛рдВрдд), рд▓реЗрдХрд┐рди рдЖрд╡рд╢реНрдпрдХрддрд╛рдУрдВ рд╕реЗ рдЕрдзрд┐рдХ рдЕрдиреБрдорддрд┐рдпрд╛рдБ рд╣реЛ рд╕рдХрддреА рд╣реИрдВред рдЖрдорддреМрд░ рдкрд░ рдПрдХ рдРрдк рд╕реЗрд╡рд╛ KeyVault рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рд╕реАрдХреНрд░реЗрдЯ рдФрд░ рдкреНрд░рдорд╛рдгрдкрддреНрд░ рдкреНрд░рд╛рдкреНрдд рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХрд░реЗрдЧреАред

рдЗрд╕рд▓рд┐рдП рдЗрди рдкрд╣рдЪрд╛рдиреЛрдВ рдХреА рдЬрд╛рдВрдЪ рдХрд░рдирд╛ рдЙрдкрдпреЛрдЧреА рд╣реЛрддрд╛ рд╣реИред

## рдРрдк рд╕реЗрд╡рд╛ SCM

рдРрдк рд╕реЗрд╡рд╛ 'рдХрдВрдЯреЗрдирд░' рдореЗрдВ рд▓реЙрдЧ рдЗрди рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдХреВрдбреВ рдХрдВрд╕реЛрд▓ред

## рд╡реЗрдмрд╢реЗрд▓

рдкреЛрд░реНрдЯрд▓.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВ рдФрд░ рд╢реЗрд▓ рдХрд╛ рдЪрдпрди рдХрд░реЗрдВ, рдпрд╛ рдмреИрд╢ рдпрд╛ рдкрд╛рд╡рд░рд╢реЗрд▓ рдХреЗ рд▓рд┐рдП shell.azure.com рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░реЗрдВред рдЗрд╕ рд╢реЗрд▓ рдХреА 'рдбрд┐рд╕реНрдХ' рдХреЛ рдПрдХ рд╕рдВрдЧреНрд░рд╣рдг-рдЦрд╛рддреЗ рдореЗрдВ рдПрдХ рдЗрдореЗрдЬ рдлрд╝рд╛рдЗрд▓ рдХреЗ рд░реВрдк рдореЗрдВ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдпрд╛ рдЬрд╛рддрд╛ рд╣реИред

## рдПрдЬрд╝реНрдпреВрд░ рдбреЗрд╡рдУрдкреНрд╕

рдПрдЬрд╝реНрдпреВрд░ рдбреЗрд╡рдУрдкреНрд╕ рдПрдЬрд╝реНрдпреВрд░ рд╕реЗ рдЕрд▓рдЧ рд╣реЛрддрд╛ рд╣реИред рдЗрд╕рдореЗрдВ рд░рд┐рдкреЙрдЬрд┐рдЯрд░реА, рдкрд╛рдЗрдкрд▓рд╛рдЗрди (yaml рдпрд╛ рд░рд┐рд▓реАрдЬ), рдмреЛрд░реНрдб, рд╡рд┐рдХрд┐ рдФрд░ рдЕрдзрд┐рдХ рд╣реЛрддрд╛ рд╣реИред рдЪрд░рдг рдЧрдгрдирд╛ рд╕рдореВрд╣ рдЙрдкрдпреЛрдЧ рдХрд┐рдП рдЬрд╛рддреЗ рд╣реИрдВ рддрд╛рдХрд┐ рдЪрд░рдг рдорд╛рдиреЛрдВ рдФрд░ рд╕реАрдХреНрд░реЗрдЯреНрд╕ рдХреЛ рд╕рдВрдЧреНрд░рд╣реАрдд рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХреЗред

## рд╕реНрд╡рдЪрд╛рд▓рд┐рдд рдЬрд╛рдБрдЪ рдЙрдкрдХрд░рдг

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

AzureHound рдПрдХ рдЦреБрд▓рд╛ рд╕реНрд░реЛрдд рдЯреВрд▓ рд╣реИ рдЬреЛ Azure AD рдФрд░ Azure рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЗ рд▓рд┐рдП рдЦреЛрдЬ рдФрд░ рд╡рд┐рд╢реНрд▓реЗрд╖рдг рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдмрдирд╛рдпрд╛ рдЧрдпрд╛ рд╣реИред рдпрд╣ рдЯреВрд▓ BloodHound рдХреЗ рдЖрдзрд╛рд░ рдкрд░ рдмрдирд╛рдпрд╛ рдЧрдпрд╛ рд╣реИ рдФрд░ рдЗрд╕рдХрд╛ рдЙрдкрдпреЛрдЧ рдиреЗрдЯрд╡рд░реНрдХ рдкреНрд░рд╢рд╛рд╕рдирд┐рдХ рд╡рд┐рд╢реНрд▓реЗрд╖рдг рдХреЗ рд▓рд┐рдП рдХрд┐рдпрд╛ рдЬрд╛ рд╕рдХрддрд╛ рд╣реИред AzureHound рдХреЗ рджреНрд╡рд╛рд░рд╛, рдЖрдк Azure AD рдФрд░ Azure рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЗ рдмреАрдЪ рд╕рдВрдмрдВрдзреЛрдВ рдХреЛ рдЦреЛрдЬ рд╕рдХрддреЗ рд╣реИрдВ рдФрд░ рдЗрд╕рдХреЗ рдЖрдзрд╛рд░ рдкрд░ рдЙрдиреНрд╣реЗрдВ рд╡рд┐рд╢реНрд▓реЗрд╖рдг рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред рдпрд╣ рдЖрдкрдХреЛ Azure рдореЗрдВ рдЕрджреНрдпрддрд┐рдд рдФрд░ рдЕрд╕реБрд░рдХреНрд╖рд┐рдд рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреА рдкрд╣рдЪрд╛рди рдХрд░рдиреЗ рдореЗрдВ рдорджрдж рдХрд░ рд╕рдХрддрд╛ рд╣реИ рдФрд░ рдЖрдкрдХреЛ рдЙрдиреНрд╣реЗрдВ рд╕реБрд░рдХреНрд╖рд┐рдд рдмрдирд╛рдиреЗ рдХреЗ рд▓рд┐рдП рдЖрд╡рд╢реНрдпрдХ рдХрджрдо рдЙрдард╛рдиреЗ рдореЗрдВ рдорджрдж рдХрд░ рд╕рдХрддрд╛ рд╣реИред

рдЗрд╕ рдЯреВрд▓ рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП, рдЖрдкрдХреЛ BloodHound рдХреЛ AzureHound рдХреЗ рд╕рд╛рде рдПрдХрд╕рд╛рде рдЪрд▓рд╛рдирд╛ рд╣реЛрдЧрд╛ред рдЖрдкрдХреЛ рдЗрд╕реЗ рдЕрдкрдиреЗ рд╕реНрдерд╛рдиреАрдп рдорд╢реАрди рдкрд░ рд╕реНрдерд╛рдкрд┐рдд рдХрд░рдирд╛ рд╣реЛрдЧрд╛ рдФрд░ рдЗрд╕рдХреЗ рд▓рд┐рдП рдЖрдкрдХреЛ Python 3 рдФрд░ рдХреБрдЫ рдЕрддрд┐рд░рд┐рдХреНрдд рдЖрд╡рд╢реНрдпрдХрддрд╛рдПрдВ рд╕реНрдерд╛рдкрд┐рдд рдХрд░рдиреА рд╣реЛрдВрдЧреАред рдЗрд╕рдХреЗ рдмрд╛рдж, рдЖрдкрдХреЛ Azure AD рдФрд░ Azure рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЗ рд▓рд┐рдП рдПрдХ рд╕реЗрд╡рд╛ рдкреНрд░рджрд╛рддрд╛ рдкреНрд░реЛрдлрд╝рд╛рдЗрд▓ рдмрдирд╛рдирд╛ рд╣реЛрдЧрд╛ рдФрд░ рдЙрд╕рдХреЗ рдмрд╛рдж рдЖрдкрдХреЛ рдЗрд╕реЗ BloodHound рдХреЗ рд╕рд╛рде рдЗрдВрдЯреАрдЧреНрд░реЗрдЯ рдХрд░рдирд╛ рд╣реЛрдЧрд╛ред рдЗрд╕рдХреЗ рдмрд╛рдж, рдЖрдк AzureHound рдХрд╛ рдЙрдкрдпреЛрдЧ рдХрд░рдХреЗ рдЦреЛрдЬ рдФрд░ рд╡рд┐рд╢реНрд▓реЗрд╖рдг рдХрд░ рд╕рдХрддреЗ рд╣реИрдВред

рдпрд╣ рдЯреВрд▓ рдЖрдкрдХреЛ Azure AD рдФрд░ Azure рд╕рдВрд╕рд╛рдзрдиреЛрдВ рдХреЗ рдмреАрдЪ рд╕рдВрдмрдВрдзреЛрдВ рдХреЛ рд╕рдордЭрдиреЗ рдореЗрдВ рдорджрдж рдХрд░ рд╕рдХрддрд╛ рд╣реИ рдФрд░ рдЖрдкрдХреЛ рд╕рдВрдЧрдарди рдХреА рд╕реБрд░рдХреНрд╖рд╛ рдореЗрдВ рд╕реБрдзрд╛рд░ рдХрд░рдиреЗ рдХреЗ рд▓рд┐рдП рдЖрд╡рд╢реНрдпрдХ рдХрджрдо рдЙрдард╛рдиреЗ рдореЗрдВ рдорджрдж рдХрд░ рд╕рдХрддрд╛ рд╣реИред
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the тАШContributorтАЩ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [рдЖрдЬрд╝реБрдХрд╛рд░](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**рдорд╛рдЗрдХреНрд░реЛрдмрд░реНрд╕реНрдЯ**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure is a PowerShell module designed to assist in penetration testing of Azure environments. It provides a set of cmdlets that can be used to gather information, perform reconnaissance, and exploit vulnerabilities in Azure resources.

PowerZure is a powerful tool for Azure penetration testing. It allows you to automate various tasks and perform targeted attacks on Azure resources. With PowerZure, you can easily gather information about Azure subscriptions, virtual machines, storage accounts, and other resources. You can also perform reconnaissance to identify potential vulnerabilities and exploit them to gain unauthorized access.

Some of the key features of PowerZure include:

- Enumeration of Azure resources: PowerZure allows you to enumerate Azure resources such as virtual machines, storage accounts, and databases. This can help you identify potential targets for further exploitation.

- Exploitation of Azure resources: PowerZure provides a set of cmdlets that can be used to exploit vulnerabilities in Azure resources. For example, you can use PowerZure to exploit weak access controls or misconfigurations in Azure storage accounts.

- Privilege escalation: PowerZure includes cmdlets that can be used to escalate privileges in Azure environments. This can help you gain higher levels of access and control over Azure resources.

- Persistence: PowerZure allows you to establish persistence in Azure environments by creating backdoors or implanting malicious code in Azure resources.

- Post-exploitation: PowerZure provides cmdlets that can be used for post-exploitation activities, such as lateral movement, data exfiltration, and covering tracks.

PowerZure is a valuable tool for penetration testers and security professionals who want to assess the security of Azure environments. It can help you identify vulnerabilities, exploit them, and gain unauthorized access to Azure resources. However, it is important to use PowerZure responsibly and with proper authorization.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>рдмрдврд╝рд┐рдпрд╛ рд╣реЛрдиреЗ рдХреЗ рд▓рд┐рдП HackTricks рдХрд╛ рд╕рдорд░реНрдерди рдХрд░реЗрдВ рдФрд░ рд▓рд╛рдн рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ!</strong></summary>

* рдпрджрд┐ рдЖрдк рдЕрдкрдиреА рдХрдВрдкрдиреА рдХреЛ **HackTricks рдореЗрдВ рд╡рд┐рдЬреНрдЮрд╛рдкрд┐рдд рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рдпрд╛ рдпрджрд┐ рдЖрдк **PEASS рдХреЗ рдирд╡реАрдирддрдо рд╕рдВрд╕реНрдХрд░рдг рджреЗрдЦрдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ рдпрд╛ HackTricks рдХреЛ PDF рдореЗрдВ рдбрд╛рдЙрдирд▓реЛрдб рдХрд░рдирд╛ рдЪрд╛рд╣рддреЗ рд╣реИрдВ** рддреЛ [**рд╕рджрд╕реНрдпрддрд╛ рдпреЛрдЬрдирд╛рдПрдВ**](https://github.com/sponsors/carlospolop) рджреЗрдЦреЗрдВ!
* [**рдЖрдзрд┐рдХрд╛рд░рд┐рдХ PEASS & HackTricks рд╕реНрд╡реИрдЧ**](https://peass.creator-spring.com) рдкреНрд░рд╛рдкреНрдд рдХрд░реЗрдВ
* [**The PEASS Family**](https://opensea.io/collection/the-peass-family) рдХреА рдЦреЛрдЬ рдХрд░реЗрдВ, рд╣рдорд╛рд░рд╛ рд╕рдВрдЧреНрд░рд╣ рдЕрдирдиреНрдп [**NFTs**](https://opensea.io/collection/the-peass-family)
* **рд╢рд╛рдорд┐рд▓ рд╣реЛрдВ** ЁЯТм [**Discord рд╕рдореВрд╣**](https://discord.gg/hRep4RUj7f) рдпрд╛ [**рдЯреЗрд▓реАрдЧреНрд░рд╛рдо рд╕рдореВрд╣**](https://t.me/peass) рдореЗрдВ рдпрд╛ **рдлреЙрд▓реЛ** рдХрд░реЗрдВ рдореБрдЭреЗ **Twitter** рдкрд░ ЁЯРж [**@carlospolopm**](https://twitter.com/carlospolopm)**.**
* **рдЕрдкрдиреЗ рд╣реИрдХрд┐рдВрдЧ рдЯреНрд░рд┐рдХреНрд╕ рд╕рд╛рдЭрд╛ рдХрд░реЗрдВ** PRs рдХреЗ рдорд╛рдзреНрдпрдо рд╕реЗ [**HackTricks**](https://github.com/carlospolop/hacktricks) рдФрд░ [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos рдореЗрдВ рд╕рдмрдорд┐рдЯ рдХрд░рдХреЗред

</details>
