# Azure Pentesting

<details>

<summary><strong>Leer AWS-hacking van nul tot held met</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Ander maniere om HackTricks te ondersteun:

* As jy jou **maatskappy geadverteer wil sien in HackTricks** of **HackTricks in PDF wil aflaai**, kyk na die [**SUBSCRIPTION PLANS**](https://github.com/sponsors/carlospolop)!
* Kry die [**amptelike PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Ontdek [**The PEASS Family**](https://opensea.io/collection/the-peass-family), ons versameling eksklusiewe [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Sluit aan by die** 💬 [**Discord-groep**](https://discord.gg/hRep4RUj7f) of die [**telegram-groep**](https://t.me/peass) of **volg** ons op **Twitter** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Deel jou hacking-truuks deur PR's in te dien by die** [**HackTricks**](https://github.com/carlospolop/hacktricks) en [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github-opslag.

</details>

## EK BOU NOG STEEDS DIE AZURE METODOLOGIE

## Basiese Inligting

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure Pentester/Red Team Metodologie

Om 'n AZURE-omgewing te oudit, is dit baie belangrik om te weet: watter **dienste word gebruik**, wat **blootgestel** word, wie het **toegang** tot wat, en hoe is interne Azure-dienste en **eksterne dienste** gekoppel.

Vanuit 'n Red Team-oogpunt is die **eerste stap om 'n Azure-omgewing te kompromitteer** om te slaag om sekere **legitieme geloofsbriewe** vir Azure AD te verkry. Hier het jy 'n paar idees oor hoe om dit te doen:

* **Lekke** in github (of soortgelyk) - OSINT
* **Sosiale** Ingenieurswese
* **Wagwoord** hergebruik (wagwoordlekke)
* Swakhede in Azure-gehoste toepassings
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) met toegang tot metadata-eindpunt
* **Plaaslike lêes van lêers**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Die lêer **`accessTokens.json`** in `az cli` voor 2.30 - Jan2022 - het **toegangstokens in teksvorm** gestoor
* Die lêer **`azureProfile.json`** bevat **inligting** oor die aangemelde gebruiker.
* **`az logout`** verwyder die token.
* Ouer weergawes van **`Az PowerShell`** het **toegangstokens** in **teksvorm** in **`TokenCache.dat`** gestoor. Dit stoor ook **ServicePrincipalSecret** in **teksvorm** in **`AzureRmContext.json`**. Die cmdlet **`Save-AzContext`** kan gebruik word om **tokens** te **stoor**.\
Gebruik `Disconnect-AzAccount` om hulle te verwyder.
* 3de partye **gekraak**
* **Interne** werknemer
* [**Gewone Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (geloofsbriewe of Oauth-toepassing)
* [Phishing vir **Toestelkode-verifikasie**](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Wagwoord Spuit**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Selfs as jy **geen gebruiker** binne die aangevalde Azure-huurder gekompromitteer het nie, kan jy **inligting versamel** daaruit:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Nadat jy daarin geslaag het om geloofsbriewe te verkry, moet jy weet **aan wie behoort daardie geloofsbriewe**, en **waartoe het hulle toegang**, dus moet jy 'n paar basiese opname uitvoer:
{% endhint %}

## Basiese Opname

{% hint style="info" %}
Onthou dat die **mees lawaaierige** deel van die opname die **aanmelding** is, nie die opname self nie.
{% endhint %}

### SSRF

As jy 'n SSRF in 'n masjien binne Azure gevind het, kyk hierdie bladsy vir truuks:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Deur Aanmeldingsvoorwaardes te omseil

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

In gevalle waar jy sekere geldige geloofsbriewe het, maar nie kan aanmeld nie, is hierdie enkele algemene beskermings wat in plek kan wees:

* **IP-witlys** -- Jy moet 'n geldige IP kompromitteer
* **Geo-beperkings** -- Vind uit waar die gebruiker woon of waar die maatskappy se kantore is en kry 'n IP van dieselfde stad (of ten minste dieselfde land)
* **Webblaaier** -- Miskien is slegs 'n webblaaier van 'n sekere bedryfstelsel (Windows, Linux, Mac, Android, iOS) toegelaat. Vind uit watter bedryfstelsel die slagoffer/maatskappy gebruik.
* Jy kan ook probeer om **Service Principal-geloofsbriewe te kompromitteer**, aangesien hulle gewoonlik minder beperk is en hul aanmelding minder nagegaan word

Nadat jy dit omseil het, kan jy dalk terugkeer na jou aanvanklike opstelling en steeds toegang hê.

### Subdomein-oorgeneem

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Wie is ek

{% hint style="danger" %}
Leer **hoe om** az cli, AzureAD en Az PowerShell in die [**Az - AzureAD**](az-azuread/) afdeling te installeer.
{% endhint %}

Een van die eerste dinge wat jy moet weet, is **wie jy is** (in watter omgewing jy is):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}AzureAD{% endtab %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Een van die belangrikste opdragte om Azure te ondersoek is **`Get-AzResource`** vanaf Az PowerShell, omdat dit jou in staat stel om **die hulpbronne te weet waaroor jou huidige gebruiker sigbaarheid het**.

Jy kan dieselfde inligting in die **webkonsol** kry deur na [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) te gaan of deur te soek na "All resources".
{% endhint %}

### AzureAD Enumerasie

Standaard behoort enige gebruiker **genoeg toestemmings te hê om dinge soos gebruikers, groepe, rolle, diensprinsipale... te ondersoek** (kyk na [standaard AzureAD-toestemmings](az-basic-information.md#default-user-permissions)).\
Jy kan hier 'n gids vind:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Nou dat jy **enkele inligting oor jou geloofsbriewe het** (en as jy 'n rooi span is, hooplik is jy **nie opgemerk nie**). Dit is tyd om uit te vind watter dienste in die omgewing gebruik word.\
In die volgende afdeling kan jy sommige maniere vind om **sekere algemene dienste te ondersoek**.
{% endhint %}

## Diensprinsipaal en Toegangbeleid

'n Azure-diens kan 'n Stelselidentiteit hê (van die diens self) of 'n Gebruikerstoegewysde Bestuurde Identiteit gebruik. Hierdie Identiteit kan Toegangbeleid hê om byvoorbeeld 'n KeyVault te gebruik om geheime te lees. Hierdie Toegangbeleide moet beperk word (minste bevoorregtingbeginsel), maar mag meer toestemmings hê as wat nodig is. Tipies sal 'n App-diens KeyVault gebruik om geheime en sertifikate te herwin.

Dit is dus nuttig om hierdie identiteite te ondersoek.

## App-diens SCM

Kudu-konsol om in te teken op die App-diens 'houer'.

## Webshell

Gebruik portal.azure.com en kies die skil, of gebruik shell.azure.com, vir 'n bash of powershell. Die 'skyf' van hierdie skil word gestoor as 'n beeldlêer in 'n stoorrekening.

## Azure DevOps

Azure DevOps is afsonderlik van Azure. Dit het bewaarplekke, pyplyne (yaml of vrystelling), borde, wiki, en meer. Veranderlike Groepe word gebruik om veranderlike waardes en geheime te stoor.

## Geoutomatiseerde Verkenningstelsels

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

AzureHound is 'n open-source projek wat ontwikkel is deur die BloodHoundAD-gemeenskap om te help met die identifisering van veiligheidskwessies in Azure-omgewings. Dit maak gebruik van die Azure Graph API om inligting oor Azure-gebruikers, groepe, rolle, toestelle en hulpbronne te ontleed en te analiseer. Hierdie inligting kan gebruik word om potensiële aanvalsveilighede en privilegie-escalasiepunte in die Azure-omgewing te identifiseer.

AzureHound kan gebruik word om die volgende tipes kwessies in Azure-omgewings te identifiseer:

- Gebruikers met onveilige wagwoorde
- Gebruikers met bevoorregte rolle
- Gebruikers met ongebruikte rolle
- Gebruikers met toegang tot gevoelige hulpbronne
- Gebruikers met toegang tot nie-gebruikte hulpbronne
- Gebruikers met toegang tot hulpbronne van ander gebruikers
- Gebruikers met toegang tot hulpbronne buite hul toegewysde rolle
- Gebruikers met toegang tot hulpbronne in ander Azure-tenante
- Gebruikers met toegang tot hulpbronne in ander Azure-omgewings

AzureHound kan gebruik word deur die volgende stappe te volg:

1. Installeer die vereiste afhanklikhede
2. Stel die vereiste omgewingsveranderlikes in
3. Voer die AzureHound-skripsie uit

Die uitset van AzureHound sal 'n grafiese weergawe van die gevonde veiligheidskwessies in die Azure-omgewing lewer, wat kan help om die nodige maatreëls te tref om die kwessies op te los.
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar is 'n nuttige hulpmiddel wat ontwikkel is deur NCC Group om te help met die outomatiese ontdekking van swakheid in Azure-omgewings. Dit maak gebruik van die Azure CLI en PowerShell om verskeie toetse uit te voer om potensiële veiligheidsprobleme te identifiseer. Hierdie hulpmiddel kan gebruik word tydens pentesting of om die veiligheid van jou eie Azure-omgewing te evalueer.

#### Installasie

Om Azucar te installeer, volg die instruksies in die [GitHub-repo](https://github.com/nccgroup/azucar). Sorg dat jy die vereistes vir die hulpmiddel het voordat jy dit installeer.

#### Gebruik

Na die installasie kan jy die hulpmiddel gebruik deur die opdraglyn te hardloop. Die hulpmiddel bied verskeie modules wat verskillende toetse uitvoer. Jy kan die modules kies wat relevant is vir jou spesifieke toepassing.

#### Opmerkings

- Azucar is 'n kragtige hulpmiddel, maar moet sorgvuldig gebruik word om enige ongewenste impak op die Azure-omgewing te voorkom.
- Dit is belangrik om toestemming te verkry voordat jy Azucar gebruik om 'n Azure-omgewing te toets.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

MicroBurst is 'n hulpmiddel wat ontwikkel is deur NetSPI om die veiligheid van Azure-omgewings te ondersoek. Dit maak gebruik van die Azure API om inligting oor die omgewing te versamel en potensiële veiligheidslekke te identifiseer. Die hulpmiddel kan gebruik word om die volgende te ondersoek:

- Blootgestelde geheime sleutels en sertifikate
- Onveilige konfigurasies
- Blootgestelde stoorhouers en databasisse
- Onveilige toegangsbeheer
- En nog baie meer

MicroBurst is 'n kragtige hulpmiddel wat gebruik kan word deur pentesters en beveiligingskonsultante om die veiligheid van Azure-omgewings te beoordeel.
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure is 'n kragtige hulpmiddel wat spesifiek ontwerp is vir pentesters en blou-teaming in die Azure-omgewing. Dit bied 'n verskeidenheid funksies en tegnieke om die veiligheid van Azure-instanties te ondersoek en te beoordeel. Hier is 'n paar van die kenmerke van PowerZure:

- **Azure AD-ondersoek**: Hierdie funksie stel jou in staat om Azure AD-gebruikers, groepe en toestelle te ondersoek en inligting soos gebruikersname, e-posadres, rolle en toestelbesonderhede te verkry.
- **Azure Resource Manager (ARM)**: PowerZure bied 'n reeks funksies om ARM-bronne te ondersoek en te manipuleer. Dit sluit in die verkenning van bronne, die verkryging van gevoelige inligting, die skep van bronne en die uitvoering van aksies soos die stoor van geheime in die sleutelkas.
- **Azure Storage**: Hierdie funksie maak dit moontlik om Azure Storage-bronne te ondersoek en te manipuleer. Dit sluit in die verkenning van stoorhouers, die aflaai en oplaai van lêers, die skep van stoorhouers en die uitvoering van aksies soos die verwydering van stoorhouers.
- **Azure Networking**: PowerZure bied ook funksies om Azure-netwerke te ondersoek en te manipuleer. Dit sluit in die verkenning van subnetwerke, virtuele masjiene en netwerkbeveiligingsgroepe, asook die uitvoering van aksies soos die skep van subnetwerke en die verwydering van virtuele masjiene.
- **Azure Functions**: Hierdie funksie maak dit moontlik om Azure Functions te ondersoek en te manipuleer. Dit sluit in die verkenning van funksies, die verkryging van funksie-inligting en die uitvoering van aksies soos die skep van funksies en die verwydering van funksies.
- **Azure Key Vault**: PowerZure bied ook funksies om Azure Key Vault-bronne te ondersoek en te manipuleer. Dit sluit in die verkenning van sleutels, geheime en sertifikate, asook die uitvoering van aksies soos die skep van sleutels en die verwydering van geheime.

PowerZure is 'n kragtige hulpmiddel wat jou kan help om die veiligheid van Azure-omgewings te ondersoek en te verbeter. Dit bied 'n wye verskeidenheid funksies en tegnieke wat jou kan help om kwesbaarhede en veiligheidslekke in jou Azure-instanties te identifiseer en te verhelp.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>Leer AWS-hacking van nul tot held met</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Ander maniere om HackTricks te ondersteun:

* As jy wil sien dat jou **maatskappy geadverteer word in HackTricks** of **HackTricks aflaai in PDF-formaat**, kyk na die [**SUBSCRIPTION PLANS**](https://github.com/sponsors/carlospolop)!
* Kry die [**amptelike PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Ontdek [**The PEASS Family**](https://opensea.io/collection/the-peass-family), ons versameling van eksklusiewe [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Sluit aan by die** 💬 [**Discord-groep**](https://discord.gg/hRep4RUj7f) of die [**telegram-groep**](https://t.me/peass) of **volg** ons op **Twitter** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Deel jou hacking-truuks deur PR's in te dien by die** [**HackTricks**](https://github.com/carlospolop/hacktricks) en [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github-opslag.

</details>
