# Pentest Azure

<details>

<summary><strong>Soutenez HackTricks et bénéficiez d'avantages !</strong></summary>

* Si vous souhaitez voir votre **entreprise annoncée dans HackTricks** ou si vous souhaitez accéder à la **dernière version de PEASS ou télécharger HackTricks en PDF**, consultez les [**PLANS D'ABONNEMENT**](https://github.com/sponsors/carlospolop) !
* Obtenez le [**swag officiel PEASS & HackTricks**](https://peass.creator-spring.com)
* Découvrez [**The PEASS Family**](https://opensea.io/collection/the-peass-family), notre collection d'exclusivités [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Rejoignez le** 💬 [**groupe Discord**](https://discord.gg/hRep4RUj7f) ou le [**groupe Telegram**](https://t.me/peass) ou **suivez** moi sur **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm).
* **Partagez vos astuces de piratage en soumettant des PR aux** [**HackTricks**](https://github.com/carlospolop/hacktricks) et [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>

## JE SUIS ENCORE EN TRAIN DE CONSTRUIRE LA MÉTHODOLOGIE AZURE

## Informations de base

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Méthodologie de test de pénétration Azure Pentester/Red Team

Pour auditer un environnement AZURE, il est très important de savoir : quels **services sont utilisés**, ce qui est **exposé**, qui a **accès** à quoi, et comment les services internes Azure et les **services externes** sont connectés.

Du point de vue d'une équipe Red Team, la **première étape pour compromettre un environnement Azure** est de parvenir à obtenir des **informations d'identification** pour Azure AD. Voici quelques idées sur la façon de le faire :

* **Fuites** sur github (ou similaire) - OSINT
* **Ingénierie** sociale
* **Réutilisation** de mots de passe (fuites de mots de passe)
* Vulnérabilités dans les applications hébergées par Azure
  * [**Forgery de requête côté serveur**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) avec accès à l'endpoint de métadonnées
  * **Lecture de fichiers locaux**
    * `/home/USERNAME/.azure`
    * `C:\Users\USERNAME\.azure`
    * Le fichier **`accessTokens.json`** dans `az cli` avant 2.30 - Jan2022 - stockait les **jetons d'accès en clair**
    * Le fichier **`azureProfile.json`** contient des **informations** sur l'utilisateur connecté.
    * **`az logout`** supprime le jeton.
    * Les anciennes versions de **`Az PowerShell`** stockaient les **jetons d'accès** en **clair** dans **`TokenCache.dat`**. Il stocke également **ServicePrincipalSecret** en texte clair dans **`AzureRmContext.json`**. La cmdlet **`Save-AzContext`** peut être utilisée pour **stocker** les **jetons**.\
      Utilisez `Disconnect-AzAccount` pour les supprimer.
* 3ème parties **compromises**
* Employé **interne**
* [**Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) commun (informations d'identification ou application Oauth)
  * [Phishing d'authentification par code de périphérique](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [**Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md) Azure

Même si vous n'avez **pas compromis d'utilisateur** à l'intérieur du locataire Azure que vous attaquez, vous pouvez **recueillir des informations** à partir de celui-ci :

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Après avoir réussi à obtenir des informations d'identification, vous devez savoir **à qui appartiennent ces informations d'identification**, et **à quoi elles ont accès**, vous devez donc effectuer une certaine énumération de base :
{% endhint %}

## Énumération de base

{% hint style="info" %}
Rappelez-vous que la partie la plus **bruyante** de l'énumération est la **connexion**, pas l'énumération elle-même.
{% endhint %}

### SSRF

Si vous avez trouvé un SSRF dans une machine à l'intérieur d'Azure, consultez cette page pour des astuces :

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Contournement des conditions de connexion

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

Dans les cas où vous disposez de certaines informations d'identification valides mais que vous ne pouvez pas vous connecter, ces protections courantes pourraient être en place :

* **Liste blanche IP** -- Vous devez compromettre une adresse IP valide
* **Restrictions géographiques** -- Trouvez où vit l'utilisateur ou où se trouvent les bureaux de l'entreprise et obtenez une adresse IP de la même ville (ou du même pays au moins)
* **Navigateur** -- Peut-être qu'un navigateur de certains OS (Windows, Linux, Mac, Android, iOS) est autorisé. Découvrez quel OS utilise la victime/l'entreprise.
* Vous pouvez également essayer de **compromettre les informations d'identification du principal de service** car elles sont généralement moins limitées et sa connexion est moins examinée.

Après l'avoir contourné, vous pourrez peut-être revenir à votre configuration initiale et vous aurez toujours accès.

### Qui suis-je

{% hint style="danger" %}
Apprenez **comment installer** az cli, AzureAD et Az PowerShell dans la section [**Az - AzureAD**](az-services/az-azuread.md).
{% endhint %}

Une des premières choses que vous devez savoir est **qui vous êtes** (dans quel environnement vous êtes) :

{% tabs %}
{% tab title="az cli" %}
```bash
az account list 
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions
### [**Stormspotter**](https://github.com/Azure/Stormspotter)

```powershell
# Démarrer le Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Démarrer le Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Exécuter Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# Cela générera un fichier .zip à télécharger dans le frontend (127.0.0.1:9091)
```

### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

```powershell
# Vous devez utiliser les modules Az PowerShell et Azure AD :
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Lancer AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Requêtes simples
## Tous les utilisateurs Azure
MATCH (n:AZUser) return n.name
## Toutes les applications Azure
MATCH (n:AZApp) return n.objectid
## Tous les appareils Azure
MATCH (n:AZDevice) return n.name
## Tous les groupes Azure
MATCH (n:AZGroup) return n.name
## Tous les coffres-forts Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## Tous les groupes de ressources Azure
MATCH (n:AZResourceGroup) return n.name
## Tous les principaux de service Azure
MATCH (n:AZServicePrincipal) return n.objectid
## Toutes les machines virtuelles Azure
MATCH (n:AZVM) return n.name
## Tous les principaux avec le rôle "Contributeur"
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Requêtes avancées
## Obtenir les administrateurs globaux
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Propriétaires des groupes Azure
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## Tous les utilisateurs Azure et leurs groupes
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Principaux de service privilégiés
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Propriétaires des applications Azure
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Chemins vers les machines virtuelles
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Chemins vers KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Chemins vers le groupe de ressources Azure
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## Utilisateurs On-Prem avec des bords vers Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## Tous les groupes Azure AD synchronisés avec AD On-Premise
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```

### [Azucar](https://github.com/nccgroup/azucar)

```bash
# Vous devez utiliser un compte avec au moins des autorisations de lecture sur les ressources auxquelles vous voulez accéder
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# Résoudre le TenantID pour un nom d'utilisateur spécifique
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```

### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```

### [**PowerZure**](https://github.com/hausec/PowerZure)

```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Lecteur
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributeur
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Télécharger le disque d'une machine virtuelle

# Propriétaire
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrateur
$ Create-Backdoor, Execute-Backdoor
```

<details>

<summary><strong>Soutenez HackTricks et obtenez des avantages !</strong></summary>

* Si vous voulez voir votre **entreprise annoncée dans HackTricks** ou si vous voulez accéder à la **dernière version de PEASS ou télécharger HackTricks en PDF** Consultez les [**PLANS D'ABONNEMENT**](https://github.com/sponsors/carlospolop)!
* Obtenez le [**swag officiel PEASS & HackTricks**](https://peass.creator-spring.com)
* Découvrez [**The PEASS Family**](https://opensea.io/collection/the-peass-family), notre collection d'[**NFTs**](https://opensea.io/collection/the-peass-family) exclusifs
* **Rejoignez** 💬 [**le groupe Discord**](https://discord.gg/hRep4RUj7f) ou le [**groupe telegram**](https://t.me/peass) ou **suivez** moi sur **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm)**.**
* **Partagez vos astuces de piratage en soumettant des PR aux** [**HackTricks**](https://github.com/carlospolop/hacktricks) et [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) **github repos.**

</details>