# Pentesting de Azure

<details>

<summary><strong>¡Apoya a HackTricks y obtén beneficios!</strong></summary>

* Si quieres ver a tu **empresa anunciada en HackTricks** o si quieres acceder a la **última versión de PEASS o descargar HackTricks en PDF** ¡Consulta los [**PLANES DE SUSCRIPCIÓN**](https://github.com/sponsors/carlospolop)!
* Obtén el [**oficial PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Descubre [**The PEASS Family**](https://opensea.io/collection/the-peass-family), nuestra colección de exclusivos [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Únete al** 💬 [**grupo de Discord**](https://discord.gg/hRep4RUj7f) o al [**grupo de telegram**](https://t.me/peass) o **sígueme** en **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm).
* **Comparte tus trucos de hacking enviando PRs a los repositorios de GitHub de** [**HackTricks**](https://github.com/carlospolop/hacktricks) y [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud).

</details>

## TODAVÍA ESTOY CONSTRUYENDO LA METODOLOGÍA DE AZURE

## Información básica

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Metodología de Pentester/Red Team de Azure

Para auditar un entorno AZURE es muy importante saber: qué **servicios se están utilizando**, qué se está **exponiendo**, quién tiene **acceso** a qué y cómo se conectan los servicios internos de Azure y los **servicios externos**.

Desde el punto de vista de un Red Team, el **primer paso para comprometer un entorno de Azure** es lograr obtener algunas **credenciales** para Azure AD. Aquí tienes algunas ideas sobre cómo hacerlo:

* **Fugas** en github (o similar) - OSINT
* **Ingeniería** social
* **Reutilización** de contraseñas (filtraciones de contraseñas)
* Vulnerabilidades en aplicaciones alojadas en Azure
  * [**Falsificación de petición en el lado del servidor**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) con acceso al punto final de metadatos
  * **Lectura de archivos locales**
    * `/home/USERNAME/.azure`
    * `C:\Users\USERNAME\.azure`
    * El archivo **`accessTokens.json`** en `az cli` antes de 2.30 - Jan2022 - almacenaba **tokens de acceso en texto claro**
    * El archivo **`azureProfile.json`** contiene **información** sobre el usuario conectado.
    * **`az logout`** elimina el token.
    * Las versiones antiguas de **`Az PowerShell`** almacenaban **tokens de acceso** en **texto claro** en **`TokenCache.dat`**. También almacena **ServicePrincipalSecret** en **texto claro** en **`AzureRmContext.json`**. El cmdlet **`Save-AzContext`** se puede utilizar para **almacenar** **tokens**.\
      Use `Disconnect-AzAccount` para eliminarlos.
* 3rd parties **violados**
* Empleado **interno**
* [**Phishing**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) común (credenciales o aplicación Oauth)
  * [Phishing de autenticación de código de dispositivo](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [**Rociado de contraseñas**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md) de Azure

Incluso si **no has comprometido a ningún usuario** dentro del inquilino de Azure que estás atacando, puedes **recopilar información** de él:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Después de haber logrado obtener credenciales, necesitas saber **a quién pertenecen esas credenciales** y **a qué tienen acceso**, por lo que necesitas realizar una enumeración básica:
{% endhint %}

## Enumeración básica

{% hint style="info" %}
Recuerda que la parte **más ruidosa** de la enumeración es el **inicio de sesión**, no la enumeración en sí.
{% endhint %}

### SSRF

Si encontraste un SSRF en una máquina dentro de Azure, revisa esta página para obtener trucos:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Saltar condiciones de inicio de sesión

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

En los casos en que tienes algunas credenciales válidas pero no puedes iniciar sesión, estas son algunas protecciones comunes que podrían estar en su lugar:

* **Lista blanca de IP** -- Necesitas comprometer una IP válida
* **Restricciones geográficas** -- Encuentra dónde vive el usuario o dónde están las oficinas de la empresa y obtén una IP de la misma ciudad (o al menos del mismo país)
* **Navegador** -- Tal vez solo se permita un navegador de cierto SO (Windows, Linux, Mac, Android, iOS). Descubre qué SO usa la víctima/empresa.
* También puedes intentar **comprometer las credenciales de Service Principal** ya que generalmente están menos limitadas y su inicio de sesión se revisa menos.

Después de saltarlo, es posible que puedas volver a tu configuración inicial y aún así tener acceso.

### Whoami

{% hint style="danger" %}
Aprende **cómo instalar** az cli, AzureAD y Az PowerShell en la sección [**Az - AzureAD**](az-services/az-azuread.md).
{% endhint %}

Una de las primeras cosas que necesitas saber es **quién eres** (en qué entorno estás):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list 
az account tenant list # Información del inquilino actual
az account subscription list # Información de la suscripción actual
az ad signed-in-user show # Usuario actual conectado
az ad signed-in-user list-owned-objects # Objetos propiedad del usuario actual
az account management-group list #No permitido por defecto
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Obtener el estado actual de la sesión
Get-AzureADCurrentSessionInfo
#Obtener detalles del inquilino actual
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %}
```powershell
# Obtener información sobre el contexto actual (Cuenta, Inquilino, Suscripción, etc.)
Get-AzContext
# Enumerar todas las suscripciones accesibles por el usuario actual
Get-AzSubscription
#Obtener grupo de recursos
Get-AzResourceGroup
# Enumerar todos los recursos visibles para el usuario actual
Get-AzResource
# Enumerar todas las asignaciones de roles de Azure RBAC
Get-AzRoleAssignment # Para todos los usuarios
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # Para el usuario actual
```
{% endtab %}
{% endtabs %}

### Enumeración de AzureAD

Por defecto, cualquier usuario debería tener **suficientes permisos para enumerar** cosas como usuarios, grupos, roles, identidades de servicio... (comprueba los [permisos de usuario predeterminados de AzureAD](az-basic-information.md#default-user-permissions)).\
Puedes encontrar aquí una guía:

{% content-ref url="az-services/az-azuread.md" %}
[az-azuread.md](az-services/az-azuread.md)
{% endcontent-ref %}

{% hint style="info" %}
Ahora que **tienes información sobre tus credenciales** (y si eres un equipo rojo, esperamos que **no hayas sido detectado**). Es hora de averiguar qué servicios se están utilizando en el entorno.\
En la siguiente sección puedes revisar algunas formas de **enumerar algunos servicios comunes**.
{% endhint %}

## Identidad de servicio y política de acceso

Un servicio de Azure puede tener una Identidad del sistema (del propio servicio) o usar una Identidad administrada asignada por el usuario. Esta Identidad puede tener una Política de acceso para, por ejemplo, un KeyVault para leer secretos. Estas Políticas de acceso
## Herramientas de Reconocimiento Automatizadas

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)

```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```

### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)

```powershell
# Iniciar Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Iniciar Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Ejecutar Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# Esto generará un archivo .zip para cargar en el frontend (127.0.0.1:9091)
```

### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

```powershell
# Debe usar los módulos Az PowerShell y Azure AD:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Lanzar AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Consultas simples
## Todos los usuarios de Azure
MATCH (n:AZUser) return n.name
## Todas las aplicaciones de Azure
MATCH (n:AZApp) return n.objectid
## Todos los dispositivos de Azure
MATCH (n:AZDevice) return n.name
## Todos los grupos de Azure
MATCH (n:AZGroup) return n.name
## Todos los almacenes de claves de Azure
MATCH (n:AZKeyVault) return n.name
## Todos los grupos de recursos de Azure
MATCH (n:AZResourceGroup) return n.name
## Todos los principales de servicio de Azure
MATCH (n:AZServicePrincipal) return n.objectid
## Todas las máquinas virtuales de Azure
MATCH (n:AZVM) return n.name
## Todos los principales con el rol 'Contributor'
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Consultas avanzadas
## Obtener administradores globales
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Propietarios de grupos de Azure
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## Todos los usuarios de Azure y sus grupos
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Principales privilegiados de servicio
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Propietarios de aplicaciones de Azure
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Rutas a las máquinas virtuales
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Rutas a KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Rutas al grupo de recursos de Azure
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## Usuarios locales con bordes a Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## Todos los grupos de Azure AD que se sincronizan con el AD local
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```

### [Azucar](https://github.com/nccgroup/azucar)

```bash
# Debe usar una cuenta con al menos permiso de lectura en los activos a los que desea acceder
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# Resolver el TenantID para un nombre de usuario específico
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```

### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```

### [**PowerZure**](https://github.com/hausec/PowerZure)

```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Lector
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contribuyente
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Descargar el disco de una máquina virtual

# Propietario
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrador
$ Create-Backdoor, Execute-Backdoor
```

<details>

<summary><strong>¡Apoya a HackTricks y obtén beneficios!</strong></summary>

* Si quieres ver tu **empresa anunciada en HackTricks** o si quieres acceder a la **última versión de PEASS o descargar HackTricks en PDF** ¡Consulta los [**PLANES DE SUSCRIPCIÓN**](https://github.com/sponsors/carlospolop)!
* Obtén el [**oficial PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Descubre [**The PEASS Family**](https://opensea.io/collection/the-peass-family), nuestra colección de exclusivos [**NFTs**](https://opensea.io/collection/the-peass-family)
* **Únete al** 💬 [**grupo de Discord**](https://discord.gg/hRep4RUj7f) o al [**grupo de telegram**](https://t.me/peass) o **sígueme** en **Twitter** 🐦 [**@carlospolopm**](https://twitter.com/carlospolopm)**.**
* **Comparte tus trucos de hacking enviando PR a los repositorios de** [**HackTricks**](https://github.com/carlospolop/hacktricks) y [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud).

</details>