# Azure Testiranje penetracije

<details>

<summary><strong>Naučite hakovanje AWS-a od nule do heroja sa</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Drugi načini podrške HackTricks-u:

* Ako želite da vidite svoju **kompaniju reklamiranu na HackTricks-u** ili da **preuzmete HackTricks u PDF formatu** proverite [**PLANOVE ZA PRIJAVU**](https://github.com/sponsors/carlospolop)!
* Nabavite [**zvanični PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Otkrijte [**Porodiču PEASS**](https://opensea.io/collection/the-peass-family), našu kolekciju ekskluzivnih [**NFT-ova**](https://opensea.io/collection/the-peass-family)
* **Pridružite se** 💬 [**Discord grupi**](https://discord.gg/hRep4RUj7f) ili [**telegram grupi**](https://t.me/peass) ili nas **pratite** na **Twitteru** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Podelite svoje hakovanje trikove slanjem PR-ova na** [**HackTricks**](https://github.com/carlospolop/hacktricks) i [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repozitorijume.

</details>

## JOŠ UVEK GRADIM AZURE METODOLOGIJU

## Osnovne informacije

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Azure Testiranje penetracije/Crveni tim metodologija

Da biste izvršili reviziju AZURE okruženja, veoma je važno znati: koje **usluge se koriste**, šta je **izloženo**, ko ima **pristup** čemu, i kako su interni Azure servisi i **spoljni servisi** povezani.

Sa stanovišta Crvenog tima, **prvi korak ka kompromitovanju Azure okruženja** je uspeh u dobijanju nekih **poverljivih podataka** za Azure AD. Evo nekih ideja kako to postići:

* **Curenja** u github-u (ili slično) - OSINT
* **Društveno** inženjerstvo
* **Ponovna upotreba lozinke** (curenje lozinki)
* Ranjivosti u Azure-hostovanim aplikacijama
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) sa pristupom tački metapodataka
* **Čitanje lokalnih fajlova**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Fajl **`accessTokens.json`** u `az cli` pre 2.30 - Jan2022 - čuva **poverljive podatke u čistom tekstu**
* Fajl **`azureProfile.json`** sadrži **informacije** o prijavljenom korisniku.
* **`az logout`** uklanja token.
* Starije verzije **`Az PowerShell`** čuvaju **poverljive podatke** u **čistom** tekstu u **`TokenCache.dat`**. Takođe čuva **ServicePrincipalSecret** u **čistom** tekstu u **`AzureRmContext.json`**. Komanda **`Save-AzContext`** može se koristiti za **čuvanje** **tokena**.\
Koristite `Disconnect-AzAccount` za njihovo uklanjanje.
* 3. lica su **hakovana**
* **Interni** zaposleni
* [**Uobičajeno ribarenje**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (poverljivi podaci ili Oauth aplikacija)
* [Ribarenje za autentifikaciju preko koda uređaja](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [Azure **Password Spraying**](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Čak i ako **niste kompromitovali nijednog korisnika** unutar Azure zakupca kojeg napadate, možete **prikupiti neke informacije** od njega:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Nakon što ste uspeli da dobijete poverljive podatke, potrebno je znati **kome ti podaci pripadaju**, i **na šta imaju pristup**, stoga morate izvršiti osnovnu enumeraciju:
{% endhint %}

## Osnovna enumeracija

{% hint style="info" %}
Zapamtite da je **najglasniji** deo enumeracije **prijava**, a ne sama enumeracija.
{% endhint %}

### SSRF

Ako pronađete SSRF na mašini unutar Azure, proverite ovu stranicu za trikove:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Bypass Uslova Prijave

<figure><img src="../../.gitbook/assets/image (268).png" alt=""><figcaption></figcaption></figure>

U slučajevima kada imate validne poverljive podatke ali ne možete se prijaviti, ovo su neke uobičajene zaštite koje mogu biti na snazi:

* **IP bela lista** -- Morate kompromitovati validnu IP adresu
* **Geografska ograničenja** -- Pronađite gde korisnik živi ili gde su kancelarije kompanije i dobijte IP adresu iz istog grada (ili barem države)
* **Pregledač** -- Možda je dozvoljen samo pregledač sa određenim OS (Windows, Linux, Mac, Android, iOS). Otkrijte koji OS koristi žrtva/kompanija.
* Takođe možete pokušati da **kompromitujete poverljive podatke servisnog principala** jer su obično manje ograničeni i njihova prijava se manje pregleda

Nakon što ih zaobiđete, možda ćete moći da se vratite na početno podešavanje i i dalje imate pristup.

### Preuzimanje poddomena

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Ko sam ja

{% hint style="danger" %}
Naučite **kako da instalirate** az cli, AzureAD i Az PowerShell u odeljku [**Az - AzureAD**](az-azuread/).
{% endhint %}

Jedna od prvih stvari koje treba da znate je **ko ste** (u kojem okruženju se nalazite):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %} 

### Uvod

U ovom odeljku ćemo istražiti nekoliko tehnika koje se mogu koristiti za testiranje bezbednosti Azure Active Directory (AzureAD).

### Pass-the-Hash napad

Pass-the-Hash napad je tehnika koja omogućava napadaču da koristi hash lozinke umesto stvarne lozinke za autentikaciju na sistemu. Ovo može biti efikasna tehnika za zaobilaženje zaštite lozinki i dobijanje pristupa sistemu.

### Brute Force napad

Brute Force napad je tehnika u kojoj napadač pokušava sve moguće kombinacije lozinki kako bi pronašao ispravnu lozinku i dobio pristup nalogu. Ovo može biti efikasan način za probijanje slabih lozinki.

### Phishing napad

Phishing napad je tehnika socijalnog inženjeringa koja podrazumeva slanje lažnih e-pošti ili poruka kako bi se korisnici doveli u zabludu da otkriju svoje lozinke ili druge osetljive informacije. Ovo može biti efikasan način za krađu pristupnih podataka.

### Zaključak

AzureAD može biti meta različitih vrsta napada, uključujući Pass-the-Hash, Brute Force i Phishing napade. Važno je redovno testirati bezbednost AzureAD kako bi se identifikovale potencijalne ranjivosti i preduzele odgovarajuće mere zaštite. 

{% endtab %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% endtab %}

{% tab title="Az PowerShell" %} 

### Az PowerShell

Az PowerShell modul je zvanični PowerShell modul za interakciju sa Azure-om. Omogućava izvršavanje različitih operacija u okviru Azure-a korišćenjem PowerShell skripti. 

#### Instalacija

Az PowerShell modul se može instalirati korišćenjem PowerShellGet modula. Evo kako možete instalirati Az PowerShell modul:

```powershell
Install-Module -Name Az -AllowClobber -Scope CurrentUser
```

#### Autentikacija

Da biste se autentikovali koristeći Az PowerShell modul, možete koristiti sledeću komandu:

```powershell
Connect-AzAccount
```

Ova komanda će vas uputiti da se prijavite koristeći prozor za prijavu koji će se otvoriti u vašem web pregledaču.

#### Primeri korišćenja

Evo nekoliko primera kako možete koristiti Az PowerShell modul:

- Prikaz svih resursnih grupa:

```powershell
Get-AzResourceGroup
```

- Kreiranje nove resursne grupe:

```powershell
New-AzResourceGroup -Name myResourceGroup -Location eastus
```

- Brisanje resursne grupe:

```powershell
Remove-AzResourceGroup -Name myResourceGroup
```

Ovo su samo neki od primera kako možete koristiti Az PowerShell modul za upravljanje Azure resursima. 

{% endtab %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Jedna od najvažnijih komandi za enumeraciju Azure-a je **`Get-AzResource`** iz Az PowerShell-a jer vam omogućava da saznate resurse koje vaš trenutni korisnik može da vidi.

Iste informacije možete dobiti i u **web konzoli** odlaskom na [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) ili pretragom "All resources".
{% endhint %}

### AzureAD Enumeracija

Podrazumevano, svaki korisnik bi trebalo da ima **dovoljno dozvola za enumeraciju** stvari poput korisnika, grupa, uloga, servisnih principala... (proverite [podrazumevane AzureAD dozvole](az-basic-information.md#default-user-permissions)).\
Ovde možete pronaći vodič:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Sada kada **imate neke informacije o svojim akreditivima** (i ako ste deo crvenog tima, nadamo se da **niste otkriveni**), vreme je da saznate koje usluge se koriste u okruženju.\
U sledećem odeljku možete proveriti neke načine za **enumeraciju nekih uobičajenih usluga**.
{% endhint %}

## Servisni princip i Politika pristupa

Azure servis može imati Identitet sistema (samog servisa) ili koristiti dodeljeni identitet upravljanih korisnika. Ovaj Identitet može imati Politiku pristupa, na primer, KeyVault-u za čitanje tajni. Ove Politike pristupa trebalo bi da budu ograničene (princip najmanjih privilegija), ali mogu imati više dozvola nego što je potrebno. Tipično, App Service bi koristio KeyVault za dobijanje tajni i sertifikata.

Stoga je korisno istražiti ove identitete.

## App Service SCM

Kudu konzola za prijavljivanje na App Service 'kontejner'.

## Webshell

Koristite portal.azure.com i izaberite shell, ili koristite shell.azure.com, za bash ili powershell. 'Disk' ovog šella se čuva kao slikovna datoteka u storage nalogu.

## Azure DevOps

Azure DevOps je odvojen od Azure-a. Ima repozitorijume, tokove (yaml ili izdanje), table, wiki i još mnogo toga. Grupi promenljivih se koriste za čuvanje vrednosti promenljivih i tajni.

## Automatizovani alati za istraživanje

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>Naučite hakovanje AWS-a od nule do heroja sa</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Drugi načini da podržite HackTricks:

* Ako želite da vidite **vašu kompaniju reklamiranu na HackTricks-u** ili da **preuzmete HackTricks u PDF formatu** proverite [**PLANOVE ZA PRIJATELJSTVO**](https://github.com/sponsors/carlospolop)!
* Nabavite [**zvanični PEASS & HackTricks swag**](https://peass.creator-spring.com)
* Otkrijte [**Porodicu PEASS**](https://opensea.io/collection/the-peass-family), našu kolekciju ekskluzivnih [**NFT-ova**](https://opensea.io/collection/the-peass-family)
* **Pridružite se** 💬 [**Discord grupi**](https://discord.gg/hRep4RUj7f) ili [**telegram grupi**](https://t.me/peass) ili nas **pratite** na **Twitteru** 🐦 [**@hacktricks\_live**](https://twitter.com/hacktricks\_live)**.**
* **Podelite svoje hakovanje trikove slanjem PR-ova na** [**HackTricks**](https://github.com/carlospolop/hacktricks) i [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repozitorijume.

</details>
