# Azure Pentesting

<details>

<summary><strong>Impara l'hacking di AWS da zero a esperto con</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Altri modi per supportare HackTricks:

* Se vuoi vedere la tua **azienda pubblicizzata su HackTricks** o **scaricare HackTricks in PDF** Controlla i [**PACCHETTI DI ABBONAMENTO**](https://github.com/sponsors/carlospolop)!
* Ottieni il [**merchandising ufficiale di PEASS & HackTricks**](https://peass.creator-spring.com)
* Scopri [**The PEASS Family**](https://opensea.io/collection/the-peass-family), la nostra collezione di esclusive [**NFT**](https://opensea.io/collection/the-peass-family)
* **Unisciti al** 💬 [**gruppo Discord**](https://discord.gg/hRep4RUj7f) o al [**gruppo Telegram**](https://t.me/peass) o **seguici** su **Twitter** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Condividi i tuoi trucchi di hacking inviando PR a** [**HackTricks**](https://github.com/carlospolop/hacktricks) e [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) github repos.

</details>

## STO ANCORA COSTRUENDO LA METODOLOGIA AZURE

## Informazioni di base

{% content-ref url="az-basic-information.md" %}
[az-basic-information.md](az-basic-information.md)
{% endcontent-ref %}

## Metodologia di Pentesting/Red Team di Azure

Per effettuare un'audit di un ambiente AZURE è molto importante sapere: quali **servizi vengono utilizzati**, cosa viene **esposto**, chi ha **accesso** a cosa e come sono collegati i servizi interni di Azure e i **servizi esterni**.

Dal punto di vista di un Red Team, il **primo passo per compromettere un ambiente Azure** è riuscire ad ottenere delle **credenziali** per Azure AD. Ecco alcune idee su come fare:

* **Leak** su github (o simili) - OSINT
* **Ingegneria** sociale
* **Riutilizzo** delle password (leak di password)
* Vulnerabilità nelle applicazioni ospitate su Azure
* [**Server Side Request Forgery**](https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf) con accesso al punto di metadati
* **Lettura di file locali**
* `/home/USERNAME/.azure`
* `C:\Users\USERNAME\.azure`
* Il file **`accessTokens.json`** in `az cli` prima della versione 2.30 - Jan2022 - memorizzava gli **access tokens in chiaro**
* Il file **`azureProfile.json`** contiene **informazioni** sull'utente loggato.
* **`az logout`** rimuove il token.
* Le versioni precedenti di **`Az PowerShell`** memorizzavano gli **access tokens** in **chiaro** nel file **`TokenCache.dat`**. Memorizza anche **ServicePrincipalSecret** in **chiaro** nel file **`AzureRmContext.json`**. Il cmdlet **`Save-AzContext`** può essere utilizzato per **memorizzare** **i token**.\
Utilizzare `Disconnect-AzAccount` per rimuoverli.
* Terze parti **violate**
* Dipendente **interno**
* [**Phishing comune**](https://book.hacktricks.xyz/generic-methodologies-and-resources/phishing-methodology) (credenziali o Oauth App)
* [Phishing di autenticazione tramite codice dispositivo](az-unauthenticated-enum-and-initial-entry/az-device-code-authentication-phishing.md)
* [**Password Spraying** di Azure](az-unauthenticated-enum-and-initial-entry/az-password-spraying.md)

Anche se **non hai compromesso alcun utente** all'interno del tenant Azure che stai attaccando, puoi **raccogliere alcune informazioni** da esso:

{% content-ref url="az-unauthenticated-enum-and-initial-entry/" %}
[az-unauthenticated-enum-and-initial-entry](az-unauthenticated-enum-and-initial-entry/)
{% endcontent-ref %}

{% hint style="info" %}
Dopo essere riuscito ad ottenere le credenziali, è necessario sapere **a chi appartengono quelle credenziali**, e **a cosa hanno accesso**, quindi è necessario eseguire una semplice enumerazione:
{% endhint %}

## Enumerazione di base

{% hint style="info" %}
Ricorda che la parte più **rumorosa** dell'enumerazione è il **login**, non l'enumerazione stessa.
{% endhint %}

### SSRF

Se hai trovato un SSRF in una macchina all'interno di Azure, controlla questa pagina per trucchi:

{% embed url="https://book.hacktricks.xyz/pentesting-web/ssrf-server-side-request-forgery/cloud-ssrf" %}

### Bypass delle condizioni di accesso

<figure><img src="../../.gitbook/assets/image (1) (2) (2).png" alt=""><figcaption></figcaption></figure>

Nei casi in cui hai delle credenziali valide ma non puoi effettuare il login, queste sono alcune protezioni comuni che potrebbero essere in atto:

* **Whitelisting degli IP** -- Devi compromettere un IP valido
* **Restrizioni geografiche** -- Trova dove vive l'utente o dove si trovano gli uffici dell'azienda e ottieni un IP dalla stessa città (o almeno dallo stesso paese)
* **Browser** -- Forse è consentito solo un browser da determinati sistemi operativi (Windows, Linux, Mac, Android, iOS). Scopri quale sistema operativo utilizza la vittima/l'azienda.
* Puoi anche provare a **compromettere le credenziali del Service Principal** poiché di solito sono meno limitate e il loro accesso viene meno controllato

Dopo averlo bypassato, potresti essere in grado di tornare alla tua configurazione iniziale e avrai comunque accesso.

### Subdomain Takeover

* [https://godiego.co/posts/STO-Azure/](https://godiego.co/posts/STO-Azure/)

### Whoami

{% hint style="danger" %}
Impara **come installare** az cli, AzureAD e Az PowerShell nella sezione [**Az - AzureAD**](az-azuread/).
{% endhint %}

Una delle prime cose che devi sapere è **chi sei** (in quale ambiente ti trovi):

{% tabs %}
{% tab title="az cli" %}
```bash
az account list
az account tenant list # Current tenant info
az account subscription list # Current subscription info
az ad signed-in-user show # Current signed-in user
az ad signed-in-user list-owned-objects # Get owned objects by current user
az account management-group list #Not allowed by default
```
{% endtab %}

{% tab title="AzureAD" %}
```powershell
#Get the current session state
Get-AzureADCurrentSessionInfo
#Get details of the current tenant
Get-AzureADTenantDetail
```
{% tab title="Az PowerShell" %}

Azure Security Center provides a set of PowerShell cmdlets that you can use to manage and automate security-related tasks in your Azure environment. These cmdlets allow you to perform actions such as enabling or disabling security recommendations, retrieving security alerts, and managing security policies.

To use the Azure Security Center cmdlets, you need to have the Azure PowerShell module installed. You can install it by running the following command:

```powershell
Install-Module -Name Az.Security
```

Once the module is installed, you can import it into your PowerShell session using the following command:

```powershell
Import-Module -Name Az.Security
```

After importing the module, you can use the available cmdlets to interact with Azure Security Center. For example, you can use the `Get-AzSecurityAlert` cmdlet to retrieve security alerts:

```powershell
Get-AzSecurityAlert -ResourceGroupName "myResourceGroup" -WorkspaceName "myWorkspace"
```

You can also use the `Set-AzSecurityPolicy` cmdlet to manage security policies:

```powershell
Set-AzSecurityPolicy -ResourceGroupName "myResourceGroup" -WorkspaceName "myWorkspace" -Policy '{"name": "myPolicy", "rules": [{"type": "AuditIfNotExists", "displayName": "Enable Network Security Group Flow Logs", "description": "Enable flow logs for all network security groups.", "parameters": {"effect": "audit", "disabled": false, "resourceTypes": ["Microsoft.Network/networkSecurityGroups"], "policyRule": {"if": {"field": "Microsoft.Network/networkSecurityGroups/flowLogs.enabled", "equals": false}, "then": {"effect": "audit"}}}}]}'
```

These are just a few examples of what you can do with the Azure Security Center cmdlets. For a complete list of available cmdlets and their usage, you can refer to the [Azure PowerShell documentation](https://docs.microsoft.com/en-us/powershell/azure/new-azureps-module-az?view=azps-10.11.0#security-module).

{% endtab %}
```powershell
# Get the information about the current context (Account, Tenant, Subscription etc.)
Get-AzContext
# List all available contexts
Get-AzContext -ListAvailable
# Enumerate subscriptions accessible by the current user
Get-AzSubscription
#Get Resource group
Get-AzResourceGroup
# Enumerate all resources visible to the current user
Get-AzResource
# Enumerate all Azure RBAC role assignments
Get-AzRoleAssignment # For all users
Get-AzRoleAssignment -SignInName test@corp.onmicrosoft.com # For current user
```
{% endtab %}
{% endtabs %}

{% hint style="danger" %}
Uno dei comandi più importanti per enumerare Azure è **`Get-AzResource`** da Az PowerShell in quanto ti permette di **conoscere le risorse su cui l'utente corrente ha visibilità**.

Puoi ottenere le stesse informazioni nella **console web** andando su [https://portal.azure.com/#view/HubsExtension/BrowseAll](https://portal.azure.com/#view/HubsExtension/BrowseAll) o cercando "Tutte le risorse"
{% endhint %}

### Enumerazione di AzureAD

Per impostazione predefinita, qualsiasi utente dovrebbe avere **permessi sufficienti per enumerare** cose come utenti, gruppi, ruoli, principali di servizio... (controlla [permessi predefiniti di AzureAD](az-basic-information.md#default-user-permissions)).\
Puoi trovare qui una guida:

{% content-ref url="az-azuread/" %}
[az-azuread](az-azuread/)
{% endcontent-ref %}

{% hint style="info" %}
Ora che **hai alcune informazioni sulle tue credenziali** (e se sei un red team speriamo che **non sia stato rilevato**). È il momento di capire quali servizi vengono utilizzati nell'ambiente.\
Nella sezione seguente puoi controllare alcuni modi per **enumerare alcuni servizi comuni**.
{% endhint %}

## Service Principal e Access Policy

Un servizio Azure può avere un'Identità di Sistema (del servizio stesso) o utilizzare un'Identità Gestita Assegnata dall'Utente. Questa Identità può avere una Access Policy per, ad esempio, un KeyVault per leggere segreti. Queste Access Policies dovrebbero essere limitate (principio del privilegio minimo), ma potrebbero avere più permessi del necessario. Tipicamente, un App Service utilizzerebbe KeyVault per recuperare segreti e certificati.

Quindi è utile esplorare queste identità.

## App Service SCM

Console Kudu per accedere al 'container' del servizio App.

## Webshell

Utilizza portal.azure.com e seleziona la shell, o utilizza shell.azure.com, per una bash o powershell. Il 'disco' di questa shell viene archiviato come un file immagine in un account di archiviazione.

## Azure DevOps

Azure DevOps è separato da Azure. Ha repository, pipeline (yaml o release), board, wiki e altro ancora. I gruppi di variabili vengono utilizzati per archiviare i valori delle variabili e i segreti.

## Strumenti di Recon automatizzati

### [**ROADRecon**](https://github.com/dirkjanm/ROADtools)
```powershell
cd ROADTools
pipenv shell
roadrecon auth -u test@corp.onmicrosoft.com -p "Welcome2022!"
roadrecon gather
roadrecon gui
```
### [Monkey365](https://github.com/silverhack/monkey365)

{% code overflow="wrap" %}
```powershell
Import-Module monkey365
Get-Help Invoke-Monkey365
Get-Help Invoke-Monkey365 -Detailed
Invoke-Monkey365 -IncludeAzureActiveDirectory -ExportTo HTML -Verbose -Debug -InformationAction Continue
Invoke-Monkey365 - Instance Azure -Analysis All -ExportTo HTML
```
{% endcode %}

### [**Stormspotter**](https://github.com/Azure/Stormspotter)
```powershell
# Start Backend
cd stormspotter\backend\
pipenv shell
python ssbackend.pyz

# Start Front-end
cd stormspotter\frontend\dist\spa\
quasar.cmd serve -p 9091 --history

# Run Stormcollector
cd stormspotter\stormcollector\
pipenv shell
az login -u test@corp.onmicrosoft.com -p Welcome2022!
python stormspotter\stormcollector\sscollector.pyz cli
# This will generate a .zip file to upload in the frontend (127.0.0.1:9091)
```
### [**AzureHound**](https://github.com/BloodHoundAD/AzureHound)

AzureHound è uno strumento open source sviluppato da BloodHoundAD che consente di eseguire la raccolta di informazioni e l'analisi delle autorizzazioni all'interno di un ambiente Azure. Utilizzando l'API di Azure Resource Graph, AzureHound può essere utilizzato per identificare potenziali vulnerabilità e punti deboli nella configurazione di Azure. Questo strumento è particolarmente utile durante un test di penetrazione per identificare possibili percorsi di attacco e privilegi elevati all'interno di un ambiente Azure.
```powershell
# You need to use the Az PowerShell and Azure AD modules:
$passwd = ConvertTo-SecureString "Welcome2022!" -AsPlainText -Force
$creds = New-Object System.Management.Automation.PSCredential ("test@corp.onmicrosoft.com", $passwd)
Connect-AzAccount -Credential $creds

Import-Module AzureAD\AzureAD.psd1
Connect-AzureAD -Credential $creds

# Launch AzureHound
. AzureHound\AzureHound.ps1
Invoke-AzureHound -Verbose

# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```
### [Azucar](https://github.com/nccgroup/azucar)

Azucar è uno strumento open source sviluppato da NCC Group per l'automazione del pentesting delle risorse di Azure. Questo strumento è progettato per identificare vulnerabilità comuni e debolezze di configurazione all'interno di un ambiente Azure. Azucar può essere utilizzato per eseguire una serie di test, inclusi test di sicurezza, test di conformità e test di penetrazione. Il suo obiettivo principale è quello di aiutare gli amministratori di sistema e i professionisti della sicurezza a identificare e risolvere le vulnerabilità all'interno delle loro risorse di Azure.
```bash
# You should use an account with at least read-permission on the assets you want to access
git clone https://github.com/nccgroup/azucar.git
PS> Get-ChildItem -Recurse c:\Azucar_V10 | Unblock-File

PS> .\Azucar.ps1 -AuthMode UseCachedCredentials -Verbose -WriteLog -Debug -ExportTo PRINT
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000
PS> .\Azucar.ps1 -ExportTo CSV,JSON,XML,EXCEL -AuthMode Certificate_Credentials -Certificate C:\AzucarTest\server.pfx -CertFilePassword MySuperP@ssw0rd! -ApplicationId 00000000-0000-0000-0000-000000000000 -TenantID 00000000-0000-0000-0000-000000000000

# resolve the TenantID for an specific username
PS> .\Azucar.ps1 -ResolveTenantUserName user@company.com
```
### [**MicroBurst**](https://github.com/NetSPI/MicroBurst)

MicroBurst is a tool developed by NetSPI that allows you to perform reconnaissance and enumeration of Azure cloud environments. It leverages the Azure Resource Manager (ARM) API to gather information about Azure subscriptions, resource groups, virtual networks, storage accounts, and more.

MicroBurst can be used to identify misconfigurations and security vulnerabilities in Azure environments, such as exposed storage containers, insecure network configurations, and weak access controls.

To use MicroBurst, you will need an Azure subscription and the necessary permissions to access and query the Azure Resource Manager API.

**Usage**

1. Clone the MicroBurst repository from GitHub:

   ```
   git clone https://github.com/NetSPI/MicroBurst.git
   ```

2. Install the required Python dependencies:

   ```
   pip install -r requirements.txt
   ```

3. Configure your Azure credentials by setting the following environment variables:

   ```
   export AZURE_CLIENT_ID=<your-client-id>
   export AZURE_CLIENT_SECRET=<your-client-secret>
   export AZURE_TENANT_ID=<your-tenant-id>
   ```

4. Run MicroBurst:

   ```
   python microburst.py
   ```

MicroBurst will start enumerating the Azure environment and display the gathered information in the console. You can also specify additional options and filters to customize the enumeration process.

**Note:** MicroBurst is a powerful tool that can provide valuable insights into Azure environments. However, it should only be used for legitimate purposes and with proper authorization. Unauthorized or malicious use of MicroBurst can lead to legal consequences.
```
Import-Module .\MicroBurst.psm1
Import-Module .\Get-AzureDomainInfo.ps1
Get-AzureDomainInfo -folder MicroBurst -Verbose
```
### [**PowerZure**](https://github.com/hausec/PowerZure)

PowerZure è uno strumento sviluppato da [hausec](https://github.com/hausec) che consente di automatizzare l'enumerazione e l'attacco di risorse di Azure. Questo strumento è scritto in PowerShell e fornisce una serie di funzionalità utili per i test di penetrazione su Azure.

PowerZure può essere utilizzato per eseguire le seguenti attività:

- Enumerazione delle risorse di Azure, come account di archiviazione, gruppi di risorse, macchine virtuali, database, etc.
- Ricerca di vulnerabilità comuni nelle risorse di Azure.
- Esecuzione di attacchi di forza bruta su account di archiviazione e macchine virtuali.
- Ottenere informazioni sulle autorizzazioni degli utenti e dei ruoli all'interno di Azure.
- Esecuzione di attacchi di phishing su utenti di Azure.

PowerZure è uno strumento molto potente che può essere utilizzato per testare la sicurezza delle risorse di Azure e identificare eventuali vulnerabilità.
```powershell
Connect-AzAccount
ipmo C:\Path\To\Powerzure.psd1
Get-AzureTarget

# Reader
$ Get-Runbook, Get-AllUsers, Get-Apps, Get-Resources, Get-WebApps, Get-WebAppDetails

# Contributor
$ Execute-Command -OS Windows -VM Win10Test -ResourceGroup Test-RG -Command "whoami"
$ Execute-MSBuild -VM Win10Test  -ResourceGroup Test-RG -File "build.xml"
$ Get-AllSecrets # AllAppSecrets, AllKeyVaultContents
$ Get-AvailableVMDisks, Get-VMDisk # Download a virtual machine's disk

# Owner
$ Set-Role -Role Contributor -User test@contoso.com -Resource Win10VMTest

# Administrator
$ Create-Backdoor, Execute-Backdoor
```
<details>

<summary><strong>Impara l'hacking di AWS da zero a eroe con</strong> <a href="https://training.hacktricks.xyz/courses/arte"><strong>htARTE (HackTricks AWS Red Team Expert)</strong></a><strong>!</strong></summary>

Altri modi per supportare HackTricks:

* Se vuoi vedere la tua **azienda pubblicizzata su HackTricks** o **scaricare HackTricks in PDF** Controlla i [**PIANI DI ABBONAMENTO**](https://github.com/sponsors/carlospolop)!
* Ottieni il [**merchandising ufficiale di PEASS & HackTricks**](https://peass.creator-spring.com)
* Scopri [**The PEASS Family**](https://opensea.io/collection/the-peass-family), la nostra collezione di [**NFT**](https://opensea.io/collection/the-peass-family) esclusivi
* **Unisciti al** 💬 [**gruppo Discord**](https://discord.gg/hRep4RUj7f) o al [**gruppo Telegram**](https://t.me/peass) o **seguici** su **Twitter** 🐦 [**@hacktricks_live**](https://twitter.com/hacktricks_live)**.**
* **Condividi i tuoi trucchi di hacking inviando PR ai repository di** [**HackTricks**](https://github.com/carlospolop/hacktricks) e [**HackTricks Cloud**](https://github.com/carlospolop/hacktricks-cloud) su GitHub.

</details>
